{"author":{"name":"Yash Agarwal","type":"card","url":"https://yashagarwal.in/"},"children":[{"content":{"html":"\n\n\n\n    \n\n    \n    \n\n    \n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/photoswipe.min.css\" integrity=\"sha256-sCl5PUOGMLfFYctzDW3MtRib0ctyUvI9Qsmq2wXOeBY=\" crossorigin=\"anonymous\" /\u003e\n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/default-skin/default-skin.min.css\" integrity=\"sha256-BFeI1V+Vh1Rk37wswuOYn5lsTcaU96hGaI7OUVCLjPc=\" crossorigin=\"anonymous\" /\u003e\n\n    \n    \u003clink rel=\"stylesheet\" href=\"/css/photoswipe.min.d780348a887d97b4d6cc664301a2941706e4a02aeb1533524fcce3b7b9b64b4f.css\"\u003e\n\n    \n\n    \n    \u003cdiv class=\"pswp\" tabindex=\"-1\" role=\"dialog\" aria-hidden=\"true\"\u003e\n        \n        \u003cdiv class=\"pswp__bg\"\u003e\u003c/div\u003e\n        \n        \u003cdiv class=\"pswp__scroll-wrap\"\u003e\n            \n            \u003cdiv class=\"pswp__container\"\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n            \u003c/div\u003e\n            \n            \u003cdiv class=\"pswp__ui pswp__ui--hidden\"\u003e\n                \u003cdiv class=\"pswp__top-bar\"\u003e\n                    \n                    \u003cdiv class=\"pswp__counter\"\u003e\u003c/div\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--close\" title=\"Close (Esc)\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--share\" title=\"Share\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--fs\" title=\"Toggle fullscreen\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--zoom\" title=\"Zoom in/out\"\u003e\u003c/button\u003e\n                    \n                    \n                    \u003cdiv class=\"pswp__preloader\"\u003e\n                        \u003cdiv class=\"pswp__preloader__icn\"\u003e\n                            \u003cdiv class=\"pswp__preloader__cut\"\u003e\n                                \u003cdiv class=\"pswp__preloader__donut\"\u003e\u003c/div\u003e\n                            \u003c/div\u003e\n                        \u003c/div\u003e\n                    \u003c/div\u003e\n                \u003c/div\u003e\n                \u003cdiv class=\"pswp__share-modal pswp__share-modal--hidden pswp__single-tap\"\u003e\n                    \u003cdiv class=\"pswp__share-tooltip\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--left\" title=\"Previous (arrow left)\"\u003e\n                \u003c/button\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--right\" title=\"Next (arrow right)\"\u003e\n                \u003c/button\u003e\n                \u003cdiv class=\"pswp__caption\"\u003e\n                    \u003cdiv class=\"pswp__caption__center\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cp\u003eI first heard about Google Summer of Code (GSoC) in my second year (2016). It was quite fascinating to know that such a program exists (possibly because of that super attractive amount of money, $5500 at that time). I researched about it and sent emails to some mentors. The replies were mostly encouraging, but I still could not gather the courage to apply as I used to doubt my capabilities. Then last year (2017) again, I decided that I should try for GSoC one more time. I looked for the projects, started reading codebase of one project, but due to my lack of determination, I again did not apply.\u003c/p\u003e\n\u003cp\u003eIn the summers of 2017, I got some time to think about it. I decided that for the next year, I will try everything to make sure that I apply for GSoC 2018. I started coding as much as possible and pushing my code to GitHub to build an impressive profile.\u003c/p\u003e\n\u003cp\u003eNow I can say that I am satisfied with my efforts to some extent. I did start some good \u003ca href=\"https://github.com/yashhere/BeautifyMP3\"\u003eopen\u003c/a\u003e \u003ca href=\"https://github.com/yashhere/ConMan\"\u003esource\u003c/a\u003e \u003ca href=\"https://github.com/yashhere/Goofy\"\u003eprojects\u003c/a\u003e. They are not very extraordinary, but something is better than nothing. I dived into Debian packaging also and volunteered for a FOSS event. Spreading awareness about FOSS is also contributing to FOSS. Isn\u0026rsquo;t it?\u003c/p\u003e\n\u003cp\u003eComing back to GSoC, this year, I have successfully submitted a proposal to the Debian Project. It does not matter whether I get it or not. I overcame one of my biggest fears of doubting my capabilities. It is something that I was trying to do for the last two years. This moment is worth celebrating.\u003c/p\u003e\n\u003cp\u003eRead about my GSoC project on \u003ca href=\"https://wiki.debian.org/SummerOfCode2018/Projects#SummerOfCode2018.2FProjects.2FBootTorrent.Boot_many_machines_via_bittorrent\"\u003eBoot Many Machines via Bittorrent\u003c/a\u003e. It is related to something which I learned in \u003ca href=\"http://athena.nitc.ac.in/\"\u003eSSL\u003c/a\u003e as SSL admin.\u003c/p\u003e\n\u003cp\u003eRead my project proposal on \u003ca href=\"https://docs.google.com/document/d/1N7wcc6rwFuauTS-jH2JuLDnZIX0w79AzTPSvSJU3PtA/edit?usp=sharing\"\u003eGoogle Drive\u003c/a\u003e or \u003ca href=\"https://wiki.debian.org/YashAgarwal/GSoCProposal\"\u003eDebian Wiki\u003c/a\u003e.\u003c/p\u003e\n\n\n\n    \u003clink rel=\"stylesheet\" href=\"/css/hugo-easy-gallery.css\"\u003e\n    \n\n\n\u003cdiv class=\"box\"  itemscope itemtype=\"http://schema.org/ImageGallery\"\u003e\n    \u003cfigure  itemprop=\"associatedMedia\" itemscope itemtype=\"http://schema.org/ImageObject\"\u003e\n        \u003cdiv class=\"img\"\u003e\n            \u003cimg itemprop=\"thumbnail\" src=\"/images/2018-03-28/gsoc-timeline.png#center\" alt=\"gsoc timeline\"/\u003e\n        \u003c/div\u003e\n        \u003ca href=\"/images/2018-03-28/gsoc-timeline.png#center\" itemprop=\"contentUrl\"\u003e\u003c/a\u003e\n    \u003c/figure\u003e\n\u003c/div\u003e\n\n\u003cp\u003eEagerly waiting for the results. 😄\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUpdate(24/04/2018)\u003c/strong\u003e: Finally, I did not get into GSoC this time too. No worries. I anticipated the results and prepared backup plans. Looking forward to a productive summer. :)\u003c/p\u003e\n","text":"                         I first heard about Google Summer of Code (GSoC) in my second year (2016). It was quite fascinating to know that such a program exists (possibly because of that super attractive amount of money, $5500 at that time). I researched about it and sent emails to some mentors. The replies were mostly encouraging, but I still could not gather the courage to apply as I used to doubt my capabilities. Then last year (2017) again, I decided that I should try for GSoC one more time. I looked for the projects, started reading codebase of one project, but due to my lack of determination, I again did not apply.\nIn the summers of 2017, I got some time to think about it. I decided that for the next year, I will try everything to make sure that I apply for GSoC 2018. I started coding as much as possible and pushing my code to GitHub to build an impressive profile.\nNow I can say that I am satisfied with my efforts to some extent. I did start some good open source projects. They are not very extraordinary, but something is better than nothing. I dived into Debian packaging also and volunteered for a FOSS event. Spreading awareness about FOSS is also contributing to FOSS. Isn\u0026rsquo;t it?\nComing back to GSoC, this year, I have successfully submitted a proposal to the Debian Project. It does not matter whether I get it or not. I overcame one of my biggest fears of doubting my capabilities. It is something that I was trying to do for the last two years. This moment is worth celebrating.\nRead about my GSoC project on Boot Many Machines via Bittorrent. It is related to something which I learned in SSL as SSL admin.\nRead my project proposal on Google Drive or Debian Wiki.\n    Eagerly waiting for the results. 😄\nUpdate(24/04/2018): Finally, I did not get into GSoC this time too. No worries. I anticipated the results and prepared backup plans. Looking forward to a productive summer. :)\n"},"name":"So I Applied for GSoC","published":"2018-03-28T20:58:26+05:30","summary":"I first heard about Google Summer of Code (GSoC) in my second year (2016). It was quite fascinating to know that such a program exists (possibly because of that super attractive amount of money, $5500 at that time). I researched about it and sent emails to some mentors.","type":"entry","url":"https://yashagarwal.in/posts/2018/03/so-i-applied-for-gsoc/"},{"content":{"html":"\u003cp\u003eI know I am very late in writing this post. It has been almost one and a half months since the last edition of FOSSMeet is over. I have been a part of FOSSMeet both as a participant and a volunteer. I want to share some of my observations, views, and suggestions through this post. I intend to keep a memory of my most favorite event of NIT Calicut. Juniors can read this post and think about ways to improve FOSSCell and FOSSMeet. I did the same by reading Kartik\u0026rsquo;s \u003ca href=\"http://techglider.in/post/2013/04/14/of-fossmeets-at-nit-calicut/\"\u003e\u003cem\u003epost\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBefore I start, if you have not read my \u003cem\u003epost\u003c/em\u003e on the 2017 edition of the FOSSMeet, it is a good time to read that first. This post is going to be a follow up from where I stopped that post. \u003ca href=\"/posts/2017/03/fossmeet17/\"\u003eHere\u003c/a\u003e is the link to that post.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;ll start by quoting some lines from the last paragraph of that article.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eI hope that I will find time next year for FOSSMeet, although I would prefer to attend FOSSMeet as a participant observing everything silently rather than being a part of the organizing team.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThese were my views after last year\u0026rsquo;s FOSSMeet. I felt that I was not getting any benefit from volunteering for FOSSMeet. It is one thing that you help conducting an event, but on a personal level, I was not learning much. I wanted to attend talks and learn about free software philosophies, but because I was busy volunteering for workshops in \u003cem\u003eSSL\u003c/em\u003e, I could not participate in any lecture. So I wanted to make sure that in my last FOSSMeet, I do attend all the talks and learn something new.\u003c/p\u003e\n\u003cp\u003eBut fate had its plans for me. Few days after writing that post, Simsar, the coordinator of FOSSMeet \u0026lsquo;17, came to my room and asked me if I would like to become the next secretary of FOSSCell. Those who don\u0026rsquo;t know, FOSSCell is the group of people in NITC, who are supposed to work on free and open-source contribution. But it is not very active for the last few years. Probably the seniors decided to give me a chance because I was quite active in providing my suggestions for the FOSSCell when I was in the third year and had shown my intentions to reinitiate FOSSCell. Anyway, I was not very enthusiastic about this opportunity and \u003cem\u003erefused\u003c/em\u003e to accept it. I thought that the topic was closed and did not bother about it much.\u003c/p\u003e\n\u003cp\u003eFast forward two months, I was at home thinking about the reasons that I could not get an internship were. I figured out some reasons (a topic reserved for a later post!) and decided that whatever happens, I will not commit these mistakes again. A few days later, Simsar messaged me on WhatsApp, asking whether I am still interested in the post of secretary. This time, I immediately accepted his offer. I was under the influence of my learnings from past mistakes. And that\u0026rsquo;s how I became the unexpected (at least for my batchmates) secretary of FOSSCell.\u003c/p\u003e\n\u003cp\u003eI was placed in the first few days of placement season, so I was free on that front. CSEA had conducted a Debian packaging workshop at the very beginning of the semester, but I could not attend that workshop. So I messaged Pirate Praveen sir privately and asked him whether he can guide me about Debian packaging. As with most of the senior open source contributors, he was very enthusiastic about helping me. So that\u0026rsquo;s how I restarted my journey in open source. It was a fun time learning about free software ideology from Pirate Praveen. We decided to conduct a small Debian Packaging hackathon in NITC. As it is a norm in CSE NITC nowadays about any such activity, people did not turn up at all for this hackathon. Only five people showed up for the hackathon. That was disappointing. Though, on a personal level, I was satisfied. I submitted two packages to the Debian unstable repository. We did not have any other activity for the remaining of that semester.\u003c/p\u003e\n\u003cp\u003eOkay, enough of the background!\u003c/p\u003e\n\u003ch2 id=\"my-observations\"\u003eMy Observations\u003c/h2\u003e\n\u003cp\u003eWe opted for the \u003ca href=\"https://talkfunnel.com\"\u003eHasGeek\u0026rsquo;s Funnel\u003c/a\u003e for the proposal acceptance this time also. The funnel works quite well for our workflow. We did not get many \u003ca href=\"https://fossmeet-nitc.talkfunnel.com/2018\"\u003eproposals\u003c/a\u003e in the beginning. I had read somewhere on the web that FOSSMeet had a MiniDebConf once. That seemed like an excellent idea to the team. So I talked with Praveen sir, about the possibility of a separate Debian track during FOSSMeet. I thought that Debian packaging might be a good and easy way to introduce NITC students to Open-source software.\u003c/p\u003e\n\u003cp\u003eIn previous editions of FOSSMeets, the organizers used to receive the \u003ca href=\"http://techglider.in/post/2013/04/14/of-fossmeets-at-nit-calicut/\"\u003efeedback\u003c/a\u003e that the student audience is entirely novice for some sessions and the supposedly advanced session turned out to be a beginner session. We were well aware of this problem and thought of a way to solve this. The solution may be a controversial one because even I have mixed feelings about this solution. We decided to look at the GitHub profiles of each participant and then select a few participants rather than allowing each and everyone who is paying money to attend the FOSSMeet. Our experience from last year was awful in this aspect. Students from various colleges of Kerala came to FOSSMeet just to get the certificate. Such an audience was not contributing anything to FOSSMeet.\u003c/p\u003e\n\u003cp\u003eNow, let me explain why I think that this is not the right way to filter good participants. If I am not wrong, one motive behind organizing such \u003cem\u003estudent run conferences\u003c/em\u003e is to inspire beginners and college students to learn about free and open-source software and to allow them to learn about new technologies. Now, it should not matter if the person has any prior experience or not. In our case, we prioritized the \u003cem\u003eprevious experience\u003c/em\u003e part and neglected \u003cem\u003ethe will to learn\u003c/em\u003e. I know that it is tough to identify if a person is really interested in the event or just coming for the certificate, but still, there must be some better way to solve this issue. For now, this method is the best option available, and it worked well enough for our purpose.\u003c/p\u003e\n\u003cp\u003eThe decision to allow only 150 participants was an excellent move. We had decided not to have parallel workshops and talks. This decision was a direct outcome of some of the bad feedback from the previous FOSSMeets. The decisions to check GitHub profiles and to restrict the number of participants made sure that this edition of FOSSMeet has the most appropriate (read qualified) audience for any session.\u003c/p\u003e\n\u003cp\u003eWe publicized the event among CSED\u0026rsquo;s first years. We even had a beginner level Git workshop for them. We were expecting that they will come to take part in the event. These events provide excellent opportunities for newcomers to learn about Computer Science and its various fields. I used to give priority to a CSEA event over any cultural event when I was in my first year. But, the turnout of first-year students for FOSSMeet was very less. I sometimes worry, how are these people going to continue organizing FOSSMeet. In the end, conducting this event will become a burden (of carrying a legacy) for them, and they will hold this event just like any other useless event that happens in NITC every weekend. We even made the entry, free for them; still, if they don\u0026rsquo;t feel interested in the event, then they are at an apparent loss.\u003c/p\u003e\n\u003cp\u003eOne other complaint that we received from the community was that the procedure of selecting proposals from the funnel is not transparent. \u003cem\u003eIn my opinion\u003c/em\u003e, it is true. The organizing team of FOSSMeet sit together and choose the topics based on the relevance of the topics and its relation to FOSS ideologies. Most of the proposals in the funnel were related to some technology or programming language. We aimed to give a chance to the talks which explain more about free software in general. Most of the proposals selected this year revolved around this theme with one or two exceptions. But I think it might be a good idea to publicly tell the factors that are taken into account while selecting proposals. FOSSMeet is an event about free software and the community, and it is the responsibility of the organizers to make sure that they adhere to the ideologies of free software, including transparency.\u003c/p\u003e\n\u003cp\u003eThe decision to select philosophical topics might seem like a great thing. Still, in reality, the student audience is not very interested in listening to some random guy preaching about something which is not very relevant to them. Students want more technical knowledge, which they can get only from technical talks and workshops. I hope that future FOSSMeet organizers will be more careful about maintaining the right balance between technical and not technical discussions and workshops.\u003c/p\u003e\n\u003cp\u003eSome students from Amrita college complained about our selection of the same speakers every year. In my opinion, it is a very valid complaint. In my last three FOSSMeets, almost 3-5 speakers are giving talks/workshops every year. I am not saying that it is bad in any way, but the organizing team can start a bit early and invite some other prominent faces of the field from different parts of the country. The issue is that we begin contacting speakers very late and the people coming from far corners of the country or from abroad get very little time for making arrangements.\u003c/p\u003e\n\u003cp\u003eWe used to have panel discussions in FOSSMeet. For the last two years, we stopped having one. I think that a panel discussion is a great way to learn about different viewpoints of experienced people. It will be good if the future organizers can squeeze one such panel discussion in the FOSSMeet schedule.\u003c/p\u003e\n\u003cp\u003eNow coming to my memories of this edition of the event, I liked the video conference by Bradley M Kuhn, the president of the Software Freedom Conservancy. The way he explained current issues in software freedom was fascinating. I was amazed by his humbleness. I was looking forward to the talk by RMS, but he could not deliver his speech due to some technical issues.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOn a lighter note\u003c/strong\u003e, It feels strange when you are working in a team where everyone except you speaks a language that you don\u0026rsquo;t understand. I know that it is a very natural behavior, and I have no \u003cem\u003ecomplains\u003c/em\u003e about it. But in my opinion, language is a tool of communication, and when you are not able to communicate your views to others, then there is some problem. When I think about these issues, I admire the forefathers of India for their farsightedness to make a \u003cem\u003eforeign\u003c/em\u003e but \u003cem\u003euniversal\u003c/em\u003e language, one of the official languages of the Republic of India.\u003c/p\u003e\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\u003cp\u003eI feel at a loss because I got the chance to attend only three FOSSMeets (2015 edition never came to reality). It has been a great experience both as a participant and a volunteer for me over the last three years. I have written two posts about FOSSMeets and have tried to cover everything which I liked or disliked about this event. I might be very \u003cem\u003ebiased\u003c/em\u003e in the views expressed here as I was very disappointed with the lack of any activity from the FOSSCell side to introduce students about open source contributions. My \u003cem\u003elack\u003c/em\u003e of good communication skills made sure that the trend continues in my tenure also. I wish good luck to the next office bearers and hope that they will not continue this trend. 😄\u003c/p\u003e\n\u003cp\u003eThanks to all fourth years \u0026ndash; Sajmal, \u003cstrong\u003eNavaneeth\u003c/strong\u003e, Nithin, Kumar, Pavithra, Vrushabh, Nitin, and others for making the FOSSMeet a success. All the best to all juniors \u0026ndash; Abhiram, Archana, Olive, Amruth, Gazala, Abhirami, Anupam, Madhumita, Adil, Vysakh, Arun, and others. Special mention to some second years also \u0026ndash; Nirmal, Faris, Darshana, Kavitha, Naina, Vishnu, and others for helping us out in a smooth organization of the event.\u003c/p\u003e\n\u003cp\u003eFeeling relieved now, as this long overdue post is finally complete. If you find the article interesting, share your views in the comments section. Thanks for reading. ☺\u003c/p\u003e\n","text":"I know I am very late in writing this post. It has been almost one and a half months since the last edition of FOSSMeet is over. I have been a part of FOSSMeet both as a participant and a volunteer. I want to share some of my observations, views, and suggestions through this post. I intend to keep a memory of my most favorite event of NIT Calicut. Juniors can read this post and think about ways to improve FOSSCell and FOSSMeet. I did the same by reading Kartik\u0026rsquo;s post.\nBefore I start, if you have not read my post on the 2017 edition of the FOSSMeet, it is a good time to read that first. This post is going to be a follow up from where I stopped that post. Here is the link to that post.\nI\u0026rsquo;ll start by quoting some lines from the last paragraph of that article.\n I hope that I will find time next year for FOSSMeet, although I would prefer to attend FOSSMeet as a participant observing everything silently rather than being a part of the organizing team.\n These were my views after last year\u0026rsquo;s FOSSMeet. I felt that I was not getting any benefit from volunteering for FOSSMeet. It is one thing that you help conducting an event, but on a personal level, I was not learning much. I wanted to attend talks and learn about free software philosophies, but because I was busy volunteering for workshops in SSL, I could not participate in any lecture. So I wanted to make sure that in my last FOSSMeet, I do attend all the talks and learn something new.\nBut fate had its plans for me. Few days after writing that post, Simsar, the coordinator of FOSSMeet \u0026lsquo;17, came to my room and asked me if I would like to become the next secretary of FOSSCell. Those who don\u0026rsquo;t know, FOSSCell is the group of people in NITC, who are supposed to work on free and open-source contribution. But it is not very active for the last few years. Probably the seniors decided to give me a chance because I was quite active in providing my suggestions for the FOSSCell when I was in the third year and had shown my intentions to reinitiate FOSSCell. Anyway, I was not very enthusiastic about this opportunity and refused to accept it. I thought that the topic was closed and did not bother about it much.\nFast forward two months, I was at home thinking about the reasons that I could not get an internship were. I figured out some reasons (a topic reserved for a later post!) and decided that whatever happens, I will not commit these mistakes again. A few days later, Simsar messaged me on WhatsApp, asking whether I am still interested in the post of secretary. This time, I immediately accepted his offer. I was under the influence of my learnings from past mistakes. And that\u0026rsquo;s how I became the unexpected (at least for my batchmates) secretary of FOSSCell.\nI was placed in the first few days of placement season, so I was free on that front. CSEA had conducted a Debian packaging workshop at the very beginning of the semester, but I could not attend that workshop. So I messaged Pirate Praveen sir privately and asked him whether he can guide me about Debian packaging. As with most of the senior open source contributors, he was very enthusiastic about helping me. So that\u0026rsquo;s how I restarted my journey in open source. It was a fun time learning about free software ideology from Pirate Praveen. We decided to conduct a small Debian Packaging hackathon in NITC. As it is a norm in CSE NITC nowadays about any such activity, people did not turn up at all for this hackathon. Only five people showed up for the hackathon. That was disappointing. Though, on a personal level, I was satisfied. I submitted two packages to the Debian unstable repository. We did not have any other activity for the remaining of that semester.\nOkay, enough of the background!\nMy Observations We opted for the HasGeek\u0026rsquo;s Funnel for the proposal acceptance this time also. The funnel works quite well for our workflow. We did not get many proposals in the beginning. I had read somewhere on the web that FOSSMeet had a MiniDebConf once. That seemed like an excellent idea to the team. So I talked with Praveen sir, about the possibility of a separate Debian track during FOSSMeet. I thought that Debian packaging might be a good and easy way to introduce NITC students to Open-source software.\nIn previous editions of FOSSMeets, the organizers used to receive the feedback that the student audience is entirely novice for some sessions and the supposedly advanced session turned out to be a beginner session. We were well aware of this problem and thought of a way to solve this. The solution may be a controversial one because even I have mixed feelings about this solution. We decided to look at the GitHub profiles of each participant and then select a few participants rather than allowing each and everyone who is paying money to attend the FOSSMeet. Our experience from last year was awful in this aspect. Students from various colleges of Kerala came to FOSSMeet just to get the certificate. Such an audience was not contributing anything to FOSSMeet.\nNow, let me explain why I think that this is not the right way to filter good participants. If I am not wrong, one motive behind organizing such student run conferences is to inspire beginners and college students to learn about free and open-source software and to allow them to learn about new technologies. Now, it should not matter if the person has any prior experience or not. In our case, we prioritized the previous experience part and neglected the will to learn. I know that it is tough to identify if a person is really interested in the event or just coming for the certificate, but still, there must be some better way to solve this issue. For now, this method is the best option available, and it worked well enough for our purpose.\nThe decision to allow only 150 participants was an excellent move. We had decided not to have parallel workshops and talks. This decision was a direct outcome of some of the bad feedback from the previous FOSSMeets. The decisions to check GitHub profiles and to restrict the number of participants made sure that this edition of FOSSMeet has the most appropriate (read qualified) audience for any session.\nWe publicized the event among CSED\u0026rsquo;s first years. We even had a beginner level Git workshop for them. We were expecting that they will come to take part in the event. These events provide excellent opportunities for newcomers to learn about Computer Science and its various fields. I used to give priority to a CSEA event over any cultural event when I was in my first year. But, the turnout of first-year students for FOSSMeet was very less. I sometimes worry, how are these people going to continue organizing FOSSMeet. In the end, conducting this event will become a burden (of carrying a legacy) for them, and they will hold this event just like any other useless event that happens in NITC every weekend. We even made the entry, free for them; still, if they don\u0026rsquo;t feel interested in the event, then they are at an apparent loss.\nOne other complaint that we received from the community was that the procedure of selecting proposals from the funnel is not transparent. In my opinion, it is true. The organizing team of FOSSMeet sit together and choose the topics based on the relevance of the topics and its relation to FOSS ideologies. Most of the proposals in the funnel were related to some technology or programming language. We aimed to give a chance to the talks which explain more about free software in general. Most of the proposals selected this year revolved around this theme with one or two exceptions. But I think it might be a good idea to publicly tell the factors that are taken into account while selecting proposals. FOSSMeet is an event about free software and the community, and it is the responsibility of the organizers to make sure that they adhere to the ideologies of free software, including transparency.\nThe decision to select philosophical topics might seem like a great thing. Still, in reality, the student audience is not very interested in listening to some random guy preaching about something which is not very relevant to them. Students want more technical knowledge, which they can get only from technical talks and workshops. I hope that future FOSSMeet organizers will be more careful about maintaining the right balance between technical and not technical discussions and workshops.\nSome students from Amrita college complained about our selection of the same speakers every year. In my opinion, it is a very valid complaint. In my last three FOSSMeets, almost 3-5 speakers are giving talks/workshops every year. I am not saying that it is bad in any way, but the organizing team can start a bit early and invite some other prominent faces of the field from different parts of the country. The issue is that we begin contacting speakers very late and the people coming from far corners of the country or from abroad get very little time for making arrangements.\nWe used to have panel discussions in FOSSMeet. For the last two years, we stopped having one. I think that a panel discussion is a great way to learn about different viewpoints of experienced people. It will be good if the future organizers can squeeze one such panel discussion in the FOSSMeet schedule.\nNow coming to my memories of this edition of the event, I liked the video conference by Bradley M Kuhn, the president of the Software Freedom Conservancy. The way he explained current issues in software freedom was fascinating. I was amazed by his humbleness. I was looking forward to the talk by RMS, but he could not deliver his speech due to some technical issues.\nOn a lighter note, It feels strange when you are working in a team where everyone except you speaks a language that you don\u0026rsquo;t understand. I know that it is a very natural behavior, and I have no complains about it. But in my opinion, language is a tool of communication, and when you are not able to communicate your views to others, then there is some problem. When I think about these issues, I admire the forefathers of India for their farsightedness to make a foreign but universal language, one of the official languages of the Republic of India.\nConclusion I feel at a loss because I got the chance to attend only three FOSSMeets (2015 edition never came to reality). It has been a great experience both as a participant and a volunteer for me over the last three years. I have written two posts about FOSSMeets and have tried to cover everything which I liked or disliked about this event. I might be very biased in the views expressed here as I was very disappointed with the lack of any activity from the FOSSCell side to introduce students about open source contributions. My lack of good communication skills made sure that the trend continues in my tenure also. I wish good luck to the next office bearers and hope that they will not continue this trend. 😄\nThanks to all fourth years \u0026ndash; Sajmal, Navaneeth, Nithin, Kumar, Pavithra, Vrushabh, Nitin, and others for making the FOSSMeet a success. All the best to all juniors \u0026ndash; Abhiram, Archana, Olive, Amruth, Gazala, Abhirami, Anupam, Madhumita, Adil, Vysakh, Arun, and others. Special mention to some second years also \u0026ndash; Nirmal, Faris, Darshana, Kavitha, Naina, Vishnu, and others for helping us out in a smooth organization of the event.\nFeeling relieved now, as this long overdue post is finally complete. If you find the article interesting, share your views in the comments section. Thanks for reading. ☺\n"},"name":"FOSSMeet'18","published":"2018-03-26T11:57:14+05:30","summary":"I know I am very late in writing this post. It has been almost one and a half months since the last edition of FOSSMeet is over. I have been a part of FOSSMeet both as a participant and a volunteer. I want to share some of my observations, views, and suggestions through this post. I intend to keep a memory of my most favorite event of NIT Calicut. Juniors can read this post and think about ways to improve FOSSCell and FOSSMeet.","type":"entry","url":"https://yashagarwal.in/posts/2018/03/fossmeet18/"},{"content":{"html":"\u003cp\u003eOne more edition of FOSSMeet\u0026rsquo;17 was successfully organized in NIT Calicut recently. As an active member of the organizing team of this year\u0026rsquo;s edition (though I sidelined myself at the end) and a keen but silent observer, I want to share my experience, ideas, and some observations through this post.\u003c/p\u003e\n\u003ch2 id=\"marketing-website\"\u003eMarketing Website\u003c/h2\u003e\n\u003cp\u003eWe started planning the next edition of FOSSMeet sometime around September. Not many people were interested in planning. Anyway, Shrimadhav and I began working on the marketing website. The first design was straightaway rejected by Piyush and Simsar, which I feel, was fruitful. In the process, I learned some critical insights about planning, team management, and design of a user-friendly website. So I again started working on the site. The end product was clean, good looking, and simple (at least I was happy with it :P).\u003c/p\u003e\n\u003cp\u003eIn the meanwhile, Amal and I started thinking about ideas, how can we restructure the FOSSCell, which had not seen a single activity (except those trademark events which were conducted just for formality) in years. I now understand that it was a mistake. It is a prerequisite about open source contribution that you should contribute to the products which you use in day to day life. When we started thinking about the FOSSCell, we didn\u0026rsquo;t know about any of these points. We conducted a formal test(more of a filtering process), then we had a small meeting with the selected 2nd years about the FOSSCell, and we discussed the plan for next semester. Then everyone left for winter vacations.\u003c/p\u003e\n\u003ch2 id=\"a-period-of-self-evaluation\"\u003eA period of self-evaluation\u003c/h2\u003e\n\u003cp\u003eIn the winter holidays, we tried to have some IRC discussions, which again was somewhat successful because of the efforts from Shrimadhav and Simsar. It was a new experience for me also, but still, I tried to attend as much as I could. I also took one session on Git and Vim, which again was an entirely new experience for me.\u003c/p\u003e\n\u003cp\u003eIn the winter vacation, I found some time to think about the purpose of FOSSMeet and FOSSCell and in what direction we were heading. I somehow understood that I was not qualified enough to guide someone about open source contribution or in general FOSS ideology, because I, myself was not contributing anything to open source community, and had no characteristic of a FOSS enthusiast. So I somehow lost my interest in FOSSCell and even in Linux. Shrimadhav asked me my ideas about FOSSCell activities, but I had no clue what to say. So that\u0026rsquo;s how the FOSSCell again died without achieving anything significant. I feel it was my mistake. I still feel sad about this. :(\u003c/p\u003e\n\u003ch2 id=\"fossmeet-time\"\u003eFOSSMeet time\u003c/h2\u003e\n\u003cp\u003eSo as the FOSSMeet\u0026rsquo;s dates came near, people started coming for \u003cem\u003evolunteering\u003c/em\u003e. It was good for the event, though. The funnel was already up last semester, and we were getting some good proposals also. FOSSMeet also went superbly. All the participants gave excellent reviews. There were some hiccups also, The Campus Internet Connectivity being the most significant one. There were some issues in SSL also, again, somewhere I hold an important responsibility. All in all, everybody praised the event and organization of the event. This year, we tried to reduce the use of plastics, and I feel that we were quite successful.\u003c/p\u003e\n\u003ch2 id=\"my-observations\"\u003eMy Observations\u003c/h2\u003e\n\u003cp\u003eThere were some issues about the event, which I didn\u0026rsquo;t like at a personal level. I sometimes think about what is the motive for conducting some activities in colleges. An event like FOSSMeet which attract the attention of all FOSS enthusiasts from all over Kerala has a huge potential of inspiring the young folks of NIT Calicut. We somehow succeed in that motive, but what about the situation after FOSSMeet. The enthusiasm about FOSS should not last just for two days, but we cannot blame others for the condition. I don\u0026rsquo;t have a proper idea about the FOSS because there was no proper guidance from my senior batches. I learned many things in the workshops organized by CSEA, in fact, I first learned the proper use of Linux Shell in the Linux workshop conducted by CSEA (and FOSSCell, at least for formality). But you can\u0026rsquo;t ask them to do everything. I think they are already overloaded. But there were no such workshops by FOSSCell.\u003c/p\u003e\n\u003cp\u003eSecond, the curriculum of the NITC CSE department focuses more on the theoretical side of Computer Science, which is good. But it negatively affects student activities outside the classroom. That is one of the primary reasons why we cannot produce more GSoC participants or why don\u0026rsquo;t we have more open source enthusiasts.\u003c/p\u003e\n\u003cp\u003eThird, one of the speakers in FOSSMeet mentioned one fundamental flaw in the structure of the organizing team of FOSSMeet. It doesn\u0026rsquo;t have any representation from other branches. FOSSMeet has become an event for CSE folks, where people from different departments do not take any interest. I think publicity was a major issue here. I don\u0026rsquo;t believe that there was any publicity done to explain FOSSMeet to the students of other branches. (If I am wrong here, please correct me).\u003c/p\u003e\n\u003cp\u003eFourth, people are ready to \u003cem\u003evolunteer\u003c/em\u003e for organizing an event, but they do not want to come and attend the workshops. FOSSMeet is held by individuals who have no previous experience of FOSS and have no intention to dive into open source community any time soon. FOSSMeet has become a tradition that is continued every year because it happened the previous year also. I do not feel that enthusiasm to promote FOSS in FOSSMeet because we are organizing it to keep the legacy. I am not saying that whatever effort organizers put in conducting FOSSMeet\u0026rsquo;17 was not significant. I am not the right person to blame them because I was also part of the same team. But still, I feel that FOSSMeet has lost its original motive to promote FOSS culture in NITC. It encourages more people from outside NITC, but inside NITC, it is just one of those many events organized by random clubs.\u003c/p\u003e\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\u003cp\u003eIt\u0026rsquo;s been an interesting one year for me after becoming SS Lab Admin because I started taking part in department activities that I always wanted to do. Being a member of the organizing team of FOSSMeet\u0026rsquo;17 was again a learning experience for me. I learned many new things, in SSL and outside SSL too. I committed some mistakes also in making the right decisions at the right moment, but that\u0026rsquo;s how I learn. So no regrets. :) I hope that I will find time next year for FOSSMeet, although I would prefer to attend FOSSMeet as a participant observing everything silently rather than being a part of the organizing team.\u003c/p\u003e\n","text":"One more edition of FOSSMeet\u0026rsquo;17 was successfully organized in NIT Calicut recently. As an active member of the organizing team of this year\u0026rsquo;s edition (though I sidelined myself at the end) and a keen but silent observer, I want to share my experience, ideas, and some observations through this post.\nMarketing Website We started planning the next edition of FOSSMeet sometime around September. Not many people were interested in planning. Anyway, Shrimadhav and I began working on the marketing website. The first design was straightaway rejected by Piyush and Simsar, which I feel, was fruitful. In the process, I learned some critical insights about planning, team management, and design of a user-friendly website. So I again started working on the site. The end product was clean, good looking, and simple (at least I was happy with it :P).\nIn the meanwhile, Amal and I started thinking about ideas, how can we restructure the FOSSCell, which had not seen a single activity (except those trademark events which were conducted just for formality) in years. I now understand that it was a mistake. It is a prerequisite about open source contribution that you should contribute to the products which you use in day to day life. When we started thinking about the FOSSCell, we didn\u0026rsquo;t know about any of these points. We conducted a formal test(more of a filtering process), then we had a small meeting with the selected 2nd years about the FOSSCell, and we discussed the plan for next semester. Then everyone left for winter vacations.\nA period of self-evaluation In the winter holidays, we tried to have some IRC discussions, which again was somewhat successful because of the efforts from Shrimadhav and Simsar. It was a new experience for me also, but still, I tried to attend as much as I could. I also took one session on Git and Vim, which again was an entirely new experience for me.\nIn the winter vacation, I found some time to think about the purpose of FOSSMeet and FOSSCell and in what direction we were heading. I somehow understood that I was not qualified enough to guide someone about open source contribution or in general FOSS ideology, because I, myself was not contributing anything to open source community, and had no characteristic of a FOSS enthusiast. So I somehow lost my interest in FOSSCell and even in Linux. Shrimadhav asked me my ideas about FOSSCell activities, but I had no clue what to say. So that\u0026rsquo;s how the FOSSCell again died without achieving anything significant. I feel it was my mistake. I still feel sad about this. :(\nFOSSMeet time So as the FOSSMeet\u0026rsquo;s dates came near, people started coming for volunteering. It was good for the event, though. The funnel was already up last semester, and we were getting some good proposals also. FOSSMeet also went superbly. All the participants gave excellent reviews. There were some hiccups also, The Campus Internet Connectivity being the most significant one. There were some issues in SSL also, again, somewhere I hold an important responsibility. All in all, everybody praised the event and organization of the event. This year, we tried to reduce the use of plastics, and I feel that we were quite successful.\nMy Observations There were some issues about the event, which I didn\u0026rsquo;t like at a personal level. I sometimes think about what is the motive for conducting some activities in colleges. An event like FOSSMeet which attract the attention of all FOSS enthusiasts from all over Kerala has a huge potential of inspiring the young folks of NIT Calicut. We somehow succeed in that motive, but what about the situation after FOSSMeet. The enthusiasm about FOSS should not last just for two days, but we cannot blame others for the condition. I don\u0026rsquo;t have a proper idea about the FOSS because there was no proper guidance from my senior batches. I learned many things in the workshops organized by CSEA, in fact, I first learned the proper use of Linux Shell in the Linux workshop conducted by CSEA (and FOSSCell, at least for formality). But you can\u0026rsquo;t ask them to do everything. I think they are already overloaded. But there were no such workshops by FOSSCell.\nSecond, the curriculum of the NITC CSE department focuses more on the theoretical side of Computer Science, which is good. But it negatively affects student activities outside the classroom. That is one of the primary reasons why we cannot produce more GSoC participants or why don\u0026rsquo;t we have more open source enthusiasts.\nThird, one of the speakers in FOSSMeet mentioned one fundamental flaw in the structure of the organizing team of FOSSMeet. It doesn\u0026rsquo;t have any representation from other branches. FOSSMeet has become an event for CSE folks, where people from different departments do not take any interest. I think publicity was a major issue here. I don\u0026rsquo;t believe that there was any publicity done to explain FOSSMeet to the students of other branches. (If I am wrong here, please correct me).\nFourth, people are ready to volunteer for organizing an event, but they do not want to come and attend the workshops. FOSSMeet is held by individuals who have no previous experience of FOSS and have no intention to dive into open source community any time soon. FOSSMeet has become a tradition that is continued every year because it happened the previous year also. I do not feel that enthusiasm to promote FOSS in FOSSMeet because we are organizing it to keep the legacy. I am not saying that whatever effort organizers put in conducting FOSSMeet\u0026rsquo;17 was not significant. I am not the right person to blame them because I was also part of the same team. But still, I feel that FOSSMeet has lost its original motive to promote FOSS culture in NITC. It encourages more people from outside NITC, but inside NITC, it is just one of those many events organized by random clubs.\nConclusion It\u0026rsquo;s been an interesting one year for me after becoming SS Lab Admin because I started taking part in department activities that I always wanted to do. Being a member of the organizing team of FOSSMeet\u0026rsquo;17 was again a learning experience for me. I learned many new things, in SSL and outside SSL too. I committed some mistakes also in making the right decisions at the right moment, but that\u0026rsquo;s how I learn. So no regrets. :) I hope that I will find time next year for FOSSMeet, although I would prefer to attend FOSSMeet as a participant observing everything silently rather than being a part of the organizing team.\n"},"name":"FOSSMeet'17","published":"2017-03-13T21:03:16Z","summary":"One more edition of FOSSMeet\u0026rsquo;17 was successfully organized in NIT Calicut recently. As an active member of the organizing team of this year\u0026rsquo;s edition (though I sidelined myself at the end) and a keen but silent observer, I want to share my experience, ideas, and some observations through this post.\nMarketing Website We started planning the next edition of FOSSMeet sometime around September. Not many people were interested in planning. Anyway, Shrimadhav and I began working on the marketing website.","type":"entry","url":"https://yashagarwal.in/posts/2017/03/fossmeet17/"}],"name":"FOSS","type":"feed","url":"https://yashagarwal.in/tags/foss/"}