{"author":{"name":"Yash Agarwal","type":"card","url":"https://yashagarwal.in/"},"content":{"html":"\n\n\n\n    \n\n    \n    \n\n    \n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/photoswipe.min.css\" integrity=\"sha256-sCl5PUOGMLfFYctzDW3MtRib0ctyUvI9Qsmq2wXOeBY=\" crossorigin=\"anonymous\" /\u003e\n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/default-skin/default-skin.min.css\" integrity=\"sha256-BFeI1V+Vh1Rk37wswuOYn5lsTcaU96hGaI7OUVCLjPc=\" crossorigin=\"anonymous\" /\u003e\n\n    \n    \u003clink rel=\"stylesheet\" href=\"/css/photoswipe.min.d780348a887d97b4d6cc664301a2941706e4a02aeb1533524fcce3b7b9b64b4f.css\"\u003e\n\n    \n\n    \n    \u003cdiv class=\"pswp\" tabindex=\"-1\" role=\"dialog\" aria-hidden=\"true\"\u003e\n        \n        \u003cdiv class=\"pswp__bg\"\u003e\u003c/div\u003e\n        \n        \u003cdiv class=\"pswp__scroll-wrap\"\u003e\n            \n            \u003cdiv class=\"pswp__container\"\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n            \u003c/div\u003e\n            \n            \u003cdiv class=\"pswp__ui pswp__ui--hidden\"\u003e\n                \u003cdiv class=\"pswp__top-bar\"\u003e\n                    \n                    \u003cdiv class=\"pswp__counter\"\u003e\u003c/div\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--close\" title=\"Close (Esc)\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--share\" title=\"Share\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--fs\" title=\"Toggle fullscreen\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--zoom\" title=\"Zoom in/out\"\u003e\u003c/button\u003e\n                    \n                    \n                    \u003cdiv class=\"pswp__preloader\"\u003e\n                        \u003cdiv class=\"pswp__preloader__icn\"\u003e\n                            \u003cdiv class=\"pswp__preloader__cut\"\u003e\n                                \u003cdiv class=\"pswp__preloader__donut\"\u003e\u003c/div\u003e\n                            \u003c/div\u003e\n                        \u003c/div\u003e\n                    \u003c/div\u003e\n                \u003c/div\u003e\n                \u003cdiv class=\"pswp__share-modal pswp__share-modal--hidden pswp__single-tap\"\u003e\n                    \u003cdiv class=\"pswp__share-tooltip\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--left\" title=\"Previous (arrow left)\"\u003e\n                \u003c/button\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--right\" title=\"Next (arrow right)\"\u003e\n                \u003c/button\u003e\n                \u003cdiv class=\"pswp__caption\"\u003e\n                    \u003cdiv class=\"pswp__caption__center\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003c!-- raw HTML omitted --\u003e\n\u003cp\u003e\u003c!-- raw HTML omitted --\u003e\u003cstrong\u003eRating: 4 / 5\u003c/strong\u003e\u003c!-- raw HTML omitted --\u003e\u003c/p\u003e\n\u003c!-- raw HTML omitted --\u003e\n\u003cp\u003eIt was my first book on the topic of personal finance. I am entirely new to managing money, so I thought it would be a\ngood idea to gain some knowledge before trying anything crazy. I must say, this book has not disappointed me. I do not\nknow, how other personal-finance books are written, but from my point of view, I learned a lot by reading this\nbook. I have already implemented some of the ideas mentioned in this book.\u003c/p\u003e\n\u003cp\u003eOne of the best things that I learned from this book is to automate everything. As a Computer Engineer, it is easily\nrelatable. The author says that if you enable automatic transfers to transfer money from your checking account to\ndifferent accounts, then you will not look at the money, and hence you will not have the urge to spend the money. A\npsychological win, isn\u0026rsquo;t it?\u003c/p\u003e\n\u003cp\u003eThe author argues in favor of passive investment - the buy and hold strategy. One of the main takeaways from this book\nwas just to get started. The author shows that it is better to do something 85% right than to wait for a long time to gain\nperfection. Especially in the case of investing, time matters a lot.\u003c/p\u003e\n\u003cp\u003eBefore reading this book, I knew only about Mutual Funds (that\u0026rsquo;s the only thing that is being advertised nowadays),\nhowever, now I know that Index Funds are a better deal and give almost similar returns in comparison of Mutual Funds while\nkeeping the expense ratios very low.\u003c/p\u003e\n\u003cp\u003eMost of the content in the book is US specific, so I would not be able to apply the techniques from this book as it is,\nhowever, the financial literacy that I gained from this book is still valuable.\u003c/p\u003e\n\u003cp\u003eHere are some of my favorite quotes from this book:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eThe 85 Percent Solution: Getting started is more important than becoming an expert.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYoung is about developing the right habits.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFear is no excuse to do nothing with your money. When others are scared, there are bargains to be found.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePeople love to argue minor points, partially because they feel it absolves them from actually having to do anything.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe single most important factor to getting rich is getting started, not being the smartest person in the room.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBecause of inflation, you’re actually losing money every day your money is sitting in a bank account.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWhen individual investors talk about complicated concepts like this, it’s like two elementary school tennis players\narguing about the string tension of their racquets. Sure, it might matter a little, but they’d be much better tennis\nplayers if they just went outside and hit some balls for a few hours each day.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCredit has a far greater impact on your finances than saving a few dollars a day on a cup of coffee.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEstablishing good credit is the first step in building an infrastructure for getting rich.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIf you have a credit card, keep it active using an automatic payment at least once every three months.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe best ways to improve your chances of getting fees waived is by keeping track of every time you call your financial institutions, including credit card companies, banks, and investment companies.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFocus on the big wins if you want bigger results.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe easiest way to manage your money is to take it one step at a time—and not worry about being perfect.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u0026ldquo;Compounding,\u0026rdquo; Albert Einstein said, \u0026ldquo;is mankind’s greatest invention because it allows for the reliable, systematic\naccumulation of wealth.\u0026rdquo;\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe key to using credit cards effectively is to pay off your credit card in full every month.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWWAID? (What would an Indian do?)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAll our lives, we\u0026rsquo;ve been taught to defer to experts: teachers, doctors, and investment \u0026ldquo;professionals.\u0026rdquo; But\nultimately, expertise is about results. You can have the fanciest degrees from the fanciest schools, but if you\ncan\u0026rsquo;t perform what you were hired to do, your expertise is meaningless.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOne of the key differences between rich people and everyone else is that rich people plan before they need to plan.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eThanks for reading :)\u003c/p\u003e\n","text":"                         Rating: 4 / 5It was my first book on the topic of personal finance. I am entirely new to managing money, so I thought it would be a good idea to gain some knowledge before trying anything crazy. I must say, this book has not disappointed me. I do not know, how other personal-finance books are written, but from my point of view, I learned a lot by reading this book. I have already implemented some of the ideas mentioned in this book.\nOne of the best things that I learned from this book is to automate everything. As a Computer Engineer, it is easily relatable. The author says that if you enable automatic transfers to transfer money from your checking account to different accounts, then you will not look at the money, and hence you will not have the urge to spend the money. A psychological win, isn\u0026rsquo;t it?\nThe author argues in favor of passive investment - the buy and hold strategy. One of the main takeaways from this book was just to get started. The author shows that it is better to do something 85% right than to wait for a long time to gain perfection. Especially in the case of investing, time matters a lot.\nBefore reading this book, I knew only about Mutual Funds (that\u0026rsquo;s the only thing that is being advertised nowadays), however, now I know that Index Funds are a better deal and give almost similar returns in comparison of Mutual Funds while keeping the expense ratios very low.\nMost of the content in the book is US specific, so I would not be able to apply the techniques from this book as it is, however, the financial literacy that I gained from this book is still valuable.\nHere are some of my favorite quotes from this book:\n  The 85 Percent Solution: Getting started is more important than becoming an expert.\n  Young is about developing the right habits.\n  Fear is no excuse to do nothing with your money. When others are scared, there are bargains to be found.\n  People love to argue minor points, partially because they feel it absolves them from actually having to do anything.\n  The single most important factor to getting rich is getting started, not being the smartest person in the room.\n  Because of inflation, you’re actually losing money every day your money is sitting in a bank account.\n  When individual investors talk about complicated concepts like this, it’s like two elementary school tennis players arguing about the string tension of their racquets. Sure, it might matter a little, but they’d be much better tennis players if they just went outside and hit some balls for a few hours each day.\n  Credit has a far greater impact on your finances than saving a few dollars a day on a cup of coffee.\n  Establishing good credit is the first step in building an infrastructure for getting rich.\n  If you have a credit card, keep it active using an automatic payment at least once every three months.\n  The best ways to improve your chances of getting fees waived is by keeping track of every time you call your financial institutions, including credit card companies, banks, and investment companies.\n  Focus on the big wins if you want bigger results.\n  The easiest way to manage your money is to take it one step at a time—and not worry about being perfect.\n  \u0026ldquo;Compounding,\u0026rdquo; Albert Einstein said, \u0026ldquo;is mankind’s greatest invention because it allows for the reliable, systematic accumulation of wealth.\u0026rdquo;\n  The key to using credit cards effectively is to pay off your credit card in full every month.\n  WWAID? (What would an Indian do?)\n  All our lives, we\u0026rsquo;ve been taught to defer to experts: teachers, doctors, and investment \u0026ldquo;professionals.\u0026rdquo; But ultimately, expertise is about results. You can have the fanciest degrees from the fanciest schools, but if you can\u0026rsquo;t perform what you were hired to do, your expertise is meaningless.\n  One of the key differences between rich people and everyone else is that rich people plan before they need to plan.\n  Thanks for reading :)\n"},"name":"I Will Teach You to Be Rich - Review","published":"2018-12-16T08:30:12+05:30","summary":"Rating: 4 / 5It was my first book on the topic of personal finance. I am entirely new to managing money, so I thought it would be a good idea to gain some knowledge before trying anything crazy. I must say, this book has not disappointed me.","type":"entry","url":"https://yashagarwal.in/notes/2018-12-16-i-will-teach-you-to-be-rich-review/"}