{"author":{"name":"Yash Agarwal","type":"card","url":"https://yashagarwal.in/"},"children":[{"content":{"html":"\u003cp\u003eFour years ago, in this very month of June, JEE Mains results were out. I had screwed up my JEE Advanced, so I had to settle for an NIT. My AIR was good enough to get me a seat of Computer Science and Engineering in any of the NITs except the first three (at that time Trichy, Warangal, and Surathkal). I was skeptical about going to \u003ca href=\"http://nitc.ac.in/\"\u003eNIT Calicut\u003c/a\u003e because of its distance from my native place, so NIT Allahabad was the most suitable choice. However, in the end, I decided to give preference to NIT Calicut over NIT Allahabad. One of the many reasons for this decision was an excellent \u003ca href=\"http://dsanghi.blogspot.com/2011/05/my-2011-list-of-recommended-csit.html\"\u003earticle\u003c/a\u003e by Dr. Dheeraj Sanghi, a retired professor from IIT Kanpur. His blog post was the primary reason; I decided to go with NIT Calicut. Now that I have graduated from NIT Calicut, I think it is the right time to document my observations about the CSE department of NIT Calicut from the perspective of a student.\u003c/p\u003e\n\u003cp\u003eMy exposure to the CSE department was limited to the facilities provided to undergraduate students only (almost everything except some academic facilities), so I am not entirely sure if this article will help any of the postgraduate students out there. However, some points below might help you decide about the non-academic activities of the department.\u003c/p\u003e\n\u003ch2 id=\"faculties\"\u003eFaculties\u003c/h2\u003e\n\u003cp\u003eLike every other NIT, NIT Calicut also suffers from the lack of permanent faculties. Most of the faculties in the department are recruited on a contract basis (ad-hoc). It is \u003cstrong\u003enot\u003c/strong\u003e necessarily a \u003ca href=\"http://dsanghi.blogspot.com/2018/05/teaching-by-temps-it-is-budget-issue-too.html\"\u003ebad\u003c/a\u003e thing, but many a time, an ad-hoc faculty gets to teach a subject where one does not hold strong command. In that case, the subject becomes a burden for both student and teacher. It happened to me many times when I was stuck in a situation that I ended up losing my interest in the subject as well as grades.\u003c/p\u003e\n\u003cp\u003eMost of the core subjects are taught by permanent faculties who are very good at their subjects. These faculties are very experienced and are alumni of some of India\u0026rsquo;s top IITs and IISc. The department used to \u003ca href=\"http://dsanghi.blogspot.com/2011/05/my-2011-list-of-recommended-csit.html\"\u003eask\u003c/a\u003e new hires to get a postgraduate degree from some IIT or IISc, but this does not seem to be the case anymore.\u003c/p\u003e\n\u003cp\u003eMost of the professors prefer to teach traditional computer science subjects, so if you are interested in AI, Data Science, or any other such areas of computer science, then you might have to depend on self-study.\u003c/p\u003e\n\u003ch2 id=\"club-activities\"\u003eClub Activities\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"http://assoc.cse.nitc.ac.in\"\u003eCSEA\u003c/a\u003e is the main departmental club that organizes almost every co-curricular activity in the department. In my opinion, CSEA is the best department association in NIT Calicut. I was not a member of CSEA, so all of my views are from the perspective of an outsider. CSEA organizes talks and workshops for the freshers from time to time. I attended all the lectures and seminars arranged by CSEA in my initial years, and I feel that those workshops were quite beneficial for me as a student.\u003c/p\u003e\n\u003cp\u003eFOSSCell is a group of students who contribute to open-source software. FOSSCell organizes workshops related to Linux and open source contributions. It also organizes \u003ca href=\"http://fossmeet.in/\"\u003eFOSSMeet\u003c/a\u003e, the yearly free and open-source software conference organized in NIT-C. It is one of the largest gatherings of open source enthusiasts in South India. I have written two posts about my experience as a part of the organizing team of FOSSMeet. You can read them \u003ca href=\"/posts/2017/03/fossmeet17/\"\u003ehere\u003c/a\u003e and \u003ca href=\"/posts/2018/03/fossmeet18/\"\u003ehere\u003c/a\u003e. Attending and organizing FOSSMeet is one of the best experiences of my college life. The current executives of FOSSCell are actively working on improving the state of open source contributions in NIT-C. I hope the situation will change in the coming years.\u003c/p\u003e\n\u003cp\u003eThe students manage all the labs in the department. The \u003ca href=\"http://athena.nitc.ac.in\"\u003eSoftware Systems Lab\u003c/a\u003e is assigned to undergraduate students. This lab is probably the crown jewel and pride of every CS student of NIT Calicut. It remains open most of the time. All the department servers are kept in this lab and are managed independently by the student administrators chosen by the student administrators. The student administrators are given the responsibility to maintain all the department websites. I do not know if any other university or college in India provides such independence to its students. I was one of the student administrators in this lab, and I consider that this was the best thing that happened to me during my graduation.\u003c/p\u003e\n\u003ch2 id=\"the-infrastructure\"\u003eThe Infrastructure\u003c/h2\u003e\n\u003cp\u003eA traditional computer science course does not require many types of equipment except a laptop and a fast enough internet connection. Internet speed is not extraordinary in NIT-C, but it was sufficient for me. The network administrators blocked many websites, but if the site is related to coursework, sending a short mail was enough in most cases to get it unblocked.\u003c/p\u003e\n\u003cp\u003eThe labs are equipped with modern computer systems, and Ubuntu is installed on almost every department system. The particular emphasis on the use of open-source software is a big plus point for the department.\u003c/p\u003e\n\u003ch2 id=\"courses\"\u003eCourses\u003c/h2\u003e\n\u003cp\u003eThe curriculum was last updated in 2010. Since then, six batches have graduated. I think it is an excellent time to consider revising it. The current curriculum is good enough for most traditional CS subjects, but its focus on the present buzzwords of the CS world is very less. I heard that the department changed the curriculum for the batches joining 2017 onwards, but I doubt that there are any significant changes.\u003c/p\u003e\n\u003c!-- raw HTML omitted --\u003e\n\u003cp\u003eThe academics are taken quite seriously in the department (apparently). The level of question papers in examinations is generally very tough. I always felt the heat, at least. However, teachers are quite friendly and will help you with any of your queries.\u003c/p\u003e\n\u003cp\u003eThe situation of lab courses (except OS, Compilers, and DSA lab) in the department is very pathetic. Operating Systems lab and Compiler lab have a well-defined structure, and the feeling of developing your tiny OS or compiler is one of the best feelings ever. Data Structure and Algorithms lab runs in parallel to the corresponding theory course, and that helps students in understanding theory by practice.\u003c/p\u003e\n\u003cp\u003eI cannot say the same about any other lab in the department; most of the students end up learning nothing new from these lab courses. The problem is in the way these courses are handled. There does not seem to be a proper structure of teaching in these courses. Students are expected to learn on their own and come to the lab and give exams. Although most of the time, the corresponding theory course carries marks for a mini project which compensates for the lab course, these lab courses do have some scope for improvements.\u003c/p\u003e\n\u003ch2 id=\"placements--higher-studies\"\u003ePlacements \u0026amp; Higher Studies\u003c/h2\u003e\n\u003cp\u003eThe department does not handle placements, but the quality of education and the focus on industry-oriented courses do affect the placements. The placement department of NIT-C has been doing an excellent job of maintaining a track record of over 90% placements from computer science every year.\u003c/p\u003e\n\u003cp\u003eDepartment, as such, does not focus on placements much. I feel that the department is more interested in making researchers than software engineers. Most of the courses are very heavily inclined towards theory. From my batch, I know at least ten people who are planning to go to the USA for higher studies in the next two years. The faculties also encourage students to pursue higher education (and subsequently research). Perhaps, it is one of the reasons that the state of competitive coding is not very good in the department.\u003c/p\u003e\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\u003cp\u003eDespite continuous lack of good permanent faculties and its location disadvantages, CSED of NIT-C has managed to produce competent engineers year by year. Spending four years in Kerala can be a different experience for outsiders, especially North Indians, but it is an experience worth gaining. If you have a good rank in JEE Mains and do not mind going too far from home, CSED of NIT Calicut is an excellent choice. I hope you will not regret the decision, though I will not say the same about other departments of NIT-C.\u003c/p\u003e\n\u003cp\u003eIf you decide to join NIT-C, do read my article about my \u003ca href=\"/posts/2018/06/mistakes-that-i-made-in-nitc/\"\u003eexperience\u003c/a\u003e at NIT Calicut.\u003c/p\u003e\n\u003cp\u003eThanks to my friends \u003ca href=\"https://www.linkedin.com/in/aashishsatya\"\u003eAashish\u003c/a\u003e, \u003ca href=\"https://www.linkedin.com/in/mahaveer-chouhan-575abba7/\"\u003eMahaveer\u003c/a\u003e and \u003ca href=\"https://www.facebook.com/faris.shajahan.1\"\u003eFaris\u003c/a\u003e for reading the drafts of this article and providing their suggestions.\u003c/p\u003e\n\u003cp\u003eBest wishes. Cheers 😄\u003c/p\u003e\n","text":"Four years ago, in this very month of June, JEE Mains results were out. I had screwed up my JEE Advanced, so I had to settle for an NIT. My AIR was good enough to get me a seat of Computer Science and Engineering in any of the NITs except the first three (at that time Trichy, Warangal, and Surathkal). I was skeptical about going to NIT Calicut because of its distance from my native place, so NIT Allahabad was the most suitable choice. However, in the end, I decided to give preference to NIT Calicut over NIT Allahabad. One of the many reasons for this decision was an excellent article by Dr. Dheeraj Sanghi, a retired professor from IIT Kanpur. His blog post was the primary reason; I decided to go with NIT Calicut. Now that I have graduated from NIT Calicut, I think it is the right time to document my observations about the CSE department of NIT Calicut from the perspective of a student.\nMy exposure to the CSE department was limited to the facilities provided to undergraduate students only (almost everything except some academic facilities), so I am not entirely sure if this article will help any of the postgraduate students out there. However, some points below might help you decide about the non-academic activities of the department.\nFaculties Like every other NIT, NIT Calicut also suffers from the lack of permanent faculties. Most of the faculties in the department are recruited on a contract basis (ad-hoc). It is not necessarily a bad thing, but many a time, an ad-hoc faculty gets to teach a subject where one does not hold strong command. In that case, the subject becomes a burden for both student and teacher. It happened to me many times when I was stuck in a situation that I ended up losing my interest in the subject as well as grades.\nMost of the core subjects are taught by permanent faculties who are very good at their subjects. These faculties are very experienced and are alumni of some of India\u0026rsquo;s top IITs and IISc. The department used to ask new hires to get a postgraduate degree from some IIT or IISc, but this does not seem to be the case anymore.\nMost of the professors prefer to teach traditional computer science subjects, so if you are interested in AI, Data Science, or any other such areas of computer science, then you might have to depend on self-study.\nClub Activities CSEA is the main departmental club that organizes almost every co-curricular activity in the department. In my opinion, CSEA is the best department association in NIT Calicut. I was not a member of CSEA, so all of my views are from the perspective of an outsider. CSEA organizes talks and workshops for the freshers from time to time. I attended all the lectures and seminars arranged by CSEA in my initial years, and I feel that those workshops were quite beneficial for me as a student.\nFOSSCell is a group of students who contribute to open-source software. FOSSCell organizes workshops related to Linux and open source contributions. It also organizes FOSSMeet, the yearly free and open-source software conference organized in NIT-C. It is one of the largest gatherings of open source enthusiasts in South India. I have written two posts about my experience as a part of the organizing team of FOSSMeet. You can read them here and here. Attending and organizing FOSSMeet is one of the best experiences of my college life. The current executives of FOSSCell are actively working on improving the state of open source contributions in NIT-C. I hope the situation will change in the coming years.\nThe students manage all the labs in the department. The Software Systems Lab is assigned to undergraduate students. This lab is probably the crown jewel and pride of every CS student of NIT Calicut. It remains open most of the time. All the department servers are kept in this lab and are managed independently by the student administrators chosen by the student administrators. The student administrators are given the responsibility to maintain all the department websites. I do not know if any other university or college in India provides such independence to its students. I was one of the student administrators in this lab, and I consider that this was the best thing that happened to me during my graduation.\nThe Infrastructure A traditional computer science course does not require many types of equipment except a laptop and a fast enough internet connection. Internet speed is not extraordinary in NIT-C, but it was sufficient for me. The network administrators blocked many websites, but if the site is related to coursework, sending a short mail was enough in most cases to get it unblocked.\nThe labs are equipped with modern computer systems, and Ubuntu is installed on almost every department system. The particular emphasis on the use of open-source software is a big plus point for the department.\nCourses The curriculum was last updated in 2010. Since then, six batches have graduated. I think it is an excellent time to consider revising it. The current curriculum is good enough for most traditional CS subjects, but its focus on the present buzzwords of the CS world is very less. I heard that the department changed the curriculum for the batches joining 2017 onwards, but I doubt that there are any significant changes.\nThe academics are taken quite seriously in the department (apparently). The level of question papers in examinations is generally very tough. I always felt the heat, at least. However, teachers are quite friendly and will help you with any of your queries.\nThe situation of lab courses (except OS, Compilers, and DSA lab) in the department is very pathetic. Operating Systems lab and Compiler lab have a well-defined structure, and the feeling of developing your tiny OS or compiler is one of the best feelings ever. Data Structure and Algorithms lab runs in parallel to the corresponding theory course, and that helps students in understanding theory by practice.\nI cannot say the same about any other lab in the department; most of the students end up learning nothing new from these lab courses. The problem is in the way these courses are handled. There does not seem to be a proper structure of teaching in these courses. Students are expected to learn on their own and come to the lab and give exams. Although most of the time, the corresponding theory course carries marks for a mini project which compensates for the lab course, these lab courses do have some scope for improvements.\nPlacements \u0026amp; Higher Studies The department does not handle placements, but the quality of education and the focus on industry-oriented courses do affect the placements. The placement department of NIT-C has been doing an excellent job of maintaining a track record of over 90% placements from computer science every year.\nDepartment, as such, does not focus on placements much. I feel that the department is more interested in making researchers than software engineers. Most of the courses are very heavily inclined towards theory. From my batch, I know at least ten people who are planning to go to the USA for higher studies in the next two years. The faculties also encourage students to pursue higher education (and subsequently research). Perhaps, it is one of the reasons that the state of competitive coding is not very good in the department.\nConclusion Despite continuous lack of good permanent faculties and its location disadvantages, CSED of NIT-C has managed to produce competent engineers year by year. Spending four years in Kerala can be a different experience for outsiders, especially North Indians, but it is an experience worth gaining. If you have a good rank in JEE Mains and do not mind going too far from home, CSED of NIT Calicut is an excellent choice. I hope you will not regret the decision, though I will not say the same about other departments of NIT-C.\nIf you decide to join NIT-C, do read my article about my experience at NIT Calicut.\nThanks to my friends Aashish, Mahaveer and Faris for reading the drafts of this article and providing their suggestions.\nBest wishes. Cheers 😄\n"},"name":"The Good and Bad about CSED of NIT-C","published":"2018-06-14T17:59:28+05:30","summary":"Four years ago, in this very month of June, JEE Mains results were out. I had screwed up my JEE Advanced, so I had to settle for an NIT. My AIR was good enough to get me a seat of Computer Science and Engineering in any of the NITs except the first three (at that time Trichy, Warangal, and Surathkal). I was skeptical about going to NIT Calicut because of its distance from my native place, so NIT Allahabad was the most suitable choice.","type":"entry","url":"https://yashagarwal.in/posts/2018/06/the-good-and-bad-about-csed-of-nit-c/"},{"content":{"html":"\u003cp\u003eNow that I am graduated from NIT Calicut, one more chapter of my life is over. It is time to move on to the next page, but before I begin that phase, I thought it would be nice, to sum up, the experience that I gathered in NIT Calicut. The last four years have been great for me. I learned a lot of new life lessons, but there were some decisions that I could have avoided. I take full responsibility for my actions and do not blame anybody for the same. Although I do not regret taking any of those decisions, I feel it is crucial to document all those lessons before they vanish from my \u003cem\u003eotherwise\u003c/em\u003e average memory. This post is intended to serve as a document for my future self, but most of the content here should be able to help anyone who happens to read this post. Most of this content has been taken from my journal, which I maintained (not consistently) over the last two years.\u003c/p\u003e\n\u003ch2 id=\"studies\"\u003eStudies\u003c/h2\u003e\n\u003cp\u003eFrom the first year itself, I had an impression from various online QA sites and some seniors that studies are not a big deal in college. That was a grave mistake which cost me a lot during my college life. I tried to compensate for it in the latter half of my graduation, but that was not enough.\u003c/p\u003e\n\u003cp\u003eWhile my friends used to learn by teaching each other, I never enjoyed studying in groups. I wish I had participated more in such group learning activities.\u003c/p\u003e\n\u003cp\u003eMost of the courses taught in traditional colleges like NITC are useless, in my opinion. However, Data Structures and Algorithms(DSA) was one subject which shows its importance again and again. It is one of those subjects where I should have put more attention. Although I was suffering from a fracture at the time of this course, some more efforts from my side could have changed things as they are today.\u003c/p\u003e\n\u003ch2 id=\"wrong-learning-methods\"\u003eWrong learning methods\u003c/h2\u003e\n\u003cp\u003eI always tended to learn anything new using the tutorials available on the Internet. It is fine, but I never tried to do any projects/practicals to strengthen my learning. In my experience, it is always better to learn any programming language by doing projects in it.\u003c/p\u003e\n\u003cp\u003eMy first programming language was C, which was taught in an introductory course in the first year. C is a relatively low-level language, and it helped me in understanding many concepts and working on many systems related stuff. Still, I feel that it is also one of the reasons that I am not able to think in higher-level abstraction. When I started learning Python, I was not able to think anything in abstract terms. I wish I had put more effort into learning Python or any other OOP language early in my college life.\u003c/p\u003e\n\u003ch2 id=\"communication\"\u003eCommunication\u003c/h2\u003e\n\u003cp\u003eI have always been an introvert person when it comes to communicating with people. I wish I had worked on improving this aspect of my personality. For the first two years, I never asked any seniors for advice, never asked any questions in the classroom, never discussed project ideas with any faculty. I tried to improve myself in the last two years, and I feel satisfied with my efforts. In my opinion, it is always better to ask a more experienced person for their advice than to take blind steps and regret later.\u003c/p\u003e\n\u003cp\u003eI was hesitant about talking to people from different linguistic backgrounds in my first and second years. Again thanks to my inability to communicate with new people. I improved this later, but first impressions are crucial, if not everything.\u003c/p\u003e\n\u003ch2 id=\"friends-and-seniors\"\u003eFriends and seniors\u003c/h2\u003e\n\u003cp\u003eIn my first year, I made a mistake by choosing to befriend some people who identified themselves as \u003cem\u003estate seniors\u003c/em\u003e (people from the same north Indian state as I am). I was naive in identifying people at that time, but when I look back now, I feel that if I had avoided those people and invested that time in learning something related to CS, I could have gained more out of college. For a person who was entirely new for CS, that one year\u0026rsquo;s time was very crucial, and I completely wasted it. It took me two years to rectify my mistake.\u003c/p\u003e\n\u003ch2 id=\"not-taking-breaks\"\u003eNot taking breaks\u003c/h2\u003e\n\u003cp\u003eI never took breaks from learning new things. I always put my work ahead of my personal life. That was the wrong approach. However, I do not blame myself for this. I was new to such work-life equations, and I did not realize the requirement to maintain a proper work-life balance. I wanted to learn a lot of new things, and college provided me a suitable environment, but I feel that I exhausted myself many times. That resulted in my loss of interest from Computer Science also in the second year.\u003c/p\u003e\n\u003ch2 id=\"writing-and-reading\"\u003eWriting and Reading\u003c/h2\u003e\n\u003cp\u003eI was never a voracious reader in my childhood. I never tried to spend my free time with books. After coming to college, I saw many people reading books day and night. That inspired me to develop a new hobby of \u003cstrong\u003eReading\u003c/strong\u003e. Although I still do not read a lot (just 5-6 books a year), it is better than reading none.\u003c/p\u003e\n\u003cp\u003eI started this blog in the second year. My intention was \u003cem\u003enot\u003c/em\u003e to write. I just wanted to learn how to set up Wordpress and Jekyll. However, slowly I developed the habit of writing. I now consider it the biggest takeaway from college. Writing a blog has helped me learn new things and systematically explain things.\u003c/p\u003e\n\u003cp\u003eI tried to write a journal to document significant events in life, but I could not maintain it regularly. That is one thing which I would like to improve in the coming years.\u003c/p\u003e\n","text":"Now that I am graduated from NIT Calicut, one more chapter of my life is over. It is time to move on to the next page, but before I begin that phase, I thought it would be nice, to sum up, the experience that I gathered in NIT Calicut. The last four years have been great for me. I learned a lot of new life lessons, but there were some decisions that I could have avoided. I take full responsibility for my actions and do not blame anybody for the same. Although I do not regret taking any of those decisions, I feel it is crucial to document all those lessons before they vanish from my otherwise average memory. This post is intended to serve as a document for my future self, but most of the content here should be able to help anyone who happens to read this post. Most of this content has been taken from my journal, which I maintained (not consistently) over the last two years.\nStudies From the first year itself, I had an impression from various online QA sites and some seniors that studies are not a big deal in college. That was a grave mistake which cost me a lot during my college life. I tried to compensate for it in the latter half of my graduation, but that was not enough.\nWhile my friends used to learn by teaching each other, I never enjoyed studying in groups. I wish I had participated more in such group learning activities.\nMost of the courses taught in traditional colleges like NITC are useless, in my opinion. However, Data Structures and Algorithms(DSA) was one subject which shows its importance again and again. It is one of those subjects where I should have put more attention. Although I was suffering from a fracture at the time of this course, some more efforts from my side could have changed things as they are today.\nWrong learning methods I always tended to learn anything new using the tutorials available on the Internet. It is fine, but I never tried to do any projects/practicals to strengthen my learning. In my experience, it is always better to learn any programming language by doing projects in it.\nMy first programming language was C, which was taught in an introductory course in the first year. C is a relatively low-level language, and it helped me in understanding many concepts and working on many systems related stuff. Still, I feel that it is also one of the reasons that I am not able to think in higher-level abstraction. When I started learning Python, I was not able to think anything in abstract terms. I wish I had put more effort into learning Python or any other OOP language early in my college life.\nCommunication I have always been an introvert person when it comes to communicating with people. I wish I had worked on improving this aspect of my personality. For the first two years, I never asked any seniors for advice, never asked any questions in the classroom, never discussed project ideas with any faculty. I tried to improve myself in the last two years, and I feel satisfied with my efforts. In my opinion, it is always better to ask a more experienced person for their advice than to take blind steps and regret later.\nI was hesitant about talking to people from different linguistic backgrounds in my first and second years. Again thanks to my inability to communicate with new people. I improved this later, but first impressions are crucial, if not everything.\nFriends and seniors In my first year, I made a mistake by choosing to befriend some people who identified themselves as state seniors (people from the same north Indian state as I am). I was naive in identifying people at that time, but when I look back now, I feel that if I had avoided those people and invested that time in learning something related to CS, I could have gained more out of college. For a person who was entirely new for CS, that one year\u0026rsquo;s time was very crucial, and I completely wasted it. It took me two years to rectify my mistake.\nNot taking breaks I never took breaks from learning new things. I always put my work ahead of my personal life. That was the wrong approach. However, I do not blame myself for this. I was new to such work-life equations, and I did not realize the requirement to maintain a proper work-life balance. I wanted to learn a lot of new things, and college provided me a suitable environment, but I feel that I exhausted myself many times. That resulted in my loss of interest from Computer Science also in the second year.\nWriting and Reading I was never a voracious reader in my childhood. I never tried to spend my free time with books. After coming to college, I saw many people reading books day and night. That inspired me to develop a new hobby of Reading. Although I still do not read a lot (just 5-6 books a year), it is better than reading none.\nI started this blog in the second year. My intention was not to write. I just wanted to learn how to set up Wordpress and Jekyll. However, slowly I developed the habit of writing. I now consider it the biggest takeaway from college. Writing a blog has helped me learn new things and systematically explain things.\nI tried to write a journal to document significant events in life, but I could not maintain it regularly. That is one thing which I would like to improve in the coming years.\n"},"name":"Mistakes That I Made in NITC","published":"2018-06-01T10:21:45+05:30","summary":"Now that I am graduated from NIT Calicut, one more chapter of my life is over. It is time to move on to the next page, but before I begin that phase, I thought it would be nice, to sum up, the experience that I gathered in NIT Calicut. The last four years have been great for me. I learned a lot of new life lessons, but there were some decisions that I could have avoided.","type":"entry","url":"https://yashagarwal.in/posts/2018/06/mistakes-that-i-made-in-nitc/"},{"content":{"html":"\n\n\n\n    \n\n    \n    \n\n    \n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/photoswipe.min.css\" integrity=\"sha256-sCl5PUOGMLfFYctzDW3MtRib0ctyUvI9Qsmq2wXOeBY=\" crossorigin=\"anonymous\" /\u003e\n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/default-skin/default-skin.min.css\" integrity=\"sha256-BFeI1V+Vh1Rk37wswuOYn5lsTcaU96hGaI7OUVCLjPc=\" crossorigin=\"anonymous\" /\u003e\n\n    \n    \u003clink rel=\"stylesheet\" href=\"/css/photoswipe.min.d780348a887d97b4d6cc664301a2941706e4a02aeb1533524fcce3b7b9b64b4f.css\"\u003e\n\n    \n\n    \n    \u003cdiv class=\"pswp\" tabindex=\"-1\" role=\"dialog\" aria-hidden=\"true\"\u003e\n        \n        \u003cdiv class=\"pswp__bg\"\u003e\u003c/div\u003e\n        \n        \u003cdiv class=\"pswp__scroll-wrap\"\u003e\n            \n            \u003cdiv class=\"pswp__container\"\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n            \u003c/div\u003e\n            \n            \u003cdiv class=\"pswp__ui pswp__ui--hidden\"\u003e\n                \u003cdiv class=\"pswp__top-bar\"\u003e\n                    \n                    \u003cdiv class=\"pswp__counter\"\u003e\u003c/div\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--close\" title=\"Close (Esc)\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--share\" title=\"Share\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--fs\" title=\"Toggle fullscreen\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--zoom\" title=\"Zoom in/out\"\u003e\u003c/button\u003e\n                    \n                    \n                    \u003cdiv class=\"pswp__preloader\"\u003e\n                        \u003cdiv class=\"pswp__preloader__icn\"\u003e\n                            \u003cdiv class=\"pswp__preloader__cut\"\u003e\n                                \u003cdiv class=\"pswp__preloader__donut\"\u003e\u003c/div\u003e\n                            \u003c/div\u003e\n                        \u003c/div\u003e\n                    \u003c/div\u003e\n                \u003c/div\u003e\n                \u003cdiv class=\"pswp__share-modal pswp__share-modal--hidden pswp__single-tap\"\u003e\n                    \u003cdiv class=\"pswp__share-tooltip\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--left\" title=\"Previous (arrow left)\"\u003e\n                \u003c/button\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--right\" title=\"Next (arrow right)\"\u003e\n                \u003c/button\u003e\n                \u003cdiv class=\"pswp__caption\"\u003e\n                    \u003cdiv class=\"pswp__caption__center\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cp\u003eI first heard about Google Summer of Code (GSoC) in my second year (2016). It was quite fascinating to know that such a program exists (possibly because of that super attractive amount of money, $5500 at that time). I researched about it and sent emails to some mentors. The replies were mostly encouraging, but I still could not gather the courage to apply as I used to doubt my capabilities. Then last year (2017) again, I decided that I should try for GSoC one more time. I looked for the projects, started reading codebase of one project, but due to my lack of determination, I again did not apply.\u003c/p\u003e\n\u003cp\u003eIn the summers of 2017, I got some time to think about it. I decided that for the next year, I will try everything to make sure that I apply for GSoC 2018. I started coding as much as possible and pushing my code to GitHub to build an impressive profile.\u003c/p\u003e\n\u003cp\u003eNow I can say that I am satisfied with my efforts to some extent. I did start some good \u003ca href=\"https://github.com/yashhere/BeautifyMP3\"\u003eopen\u003c/a\u003e \u003ca href=\"https://github.com/yashhere/ConMan\"\u003esource\u003c/a\u003e \u003ca href=\"https://github.com/yashhere/Goofy\"\u003eprojects\u003c/a\u003e. They are not very extraordinary, but something is better than nothing. I dived into Debian packaging also and volunteered for a FOSS event. Spreading awareness about FOSS is also contributing to FOSS. Isn\u0026rsquo;t it?\u003c/p\u003e\n\u003cp\u003eComing back to GSoC, this year, I have successfully submitted a proposal to the Debian Project. It does not matter whether I get it or not. I overcame one of my biggest fears of doubting my capabilities. It is something that I was trying to do for the last two years. This moment is worth celebrating.\u003c/p\u003e\n\u003cp\u003eRead about my GSoC project on \u003ca href=\"https://wiki.debian.org/SummerOfCode2018/Projects#SummerOfCode2018.2FProjects.2FBootTorrent.Boot_many_machines_via_bittorrent\"\u003eBoot Many Machines via Bittorrent\u003c/a\u003e. It is related to something which I learned in \u003ca href=\"http://athena.nitc.ac.in/\"\u003eSSL\u003c/a\u003e as SSL admin.\u003c/p\u003e\n\u003cp\u003eRead my project proposal on \u003ca href=\"https://docs.google.com/document/d/1N7wcc6rwFuauTS-jH2JuLDnZIX0w79AzTPSvSJU3PtA/edit?usp=sharing\"\u003eGoogle Drive\u003c/a\u003e or \u003ca href=\"https://wiki.debian.org/YashAgarwal/GSoCProposal\"\u003eDebian Wiki\u003c/a\u003e.\u003c/p\u003e\n\n\n\n    \u003clink rel=\"stylesheet\" href=\"/css/hugo-easy-gallery.css\"\u003e\n    \n\n\n\u003cdiv class=\"box\"  itemscope itemtype=\"http://schema.org/ImageGallery\"\u003e\n    \u003cfigure  itemprop=\"associatedMedia\" itemscope itemtype=\"http://schema.org/ImageObject\"\u003e\n        \u003cdiv class=\"img\"\u003e\n            \u003cimg itemprop=\"thumbnail\" src=\"/images/posts/2018-03-28/gsoc-timeline.png#center\" alt=\"gsoc timeline\"/\u003e\n        \u003c/div\u003e\n        \u003ca href=\"/images/posts/2018-03-28/gsoc-timeline.png#center\" itemprop=\"contentUrl\"\u003e\u003c/a\u003e\n    \u003c/figure\u003e\n\u003c/div\u003e\n\n\u003cp\u003eEagerly waiting for the results. 😄\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUpdate(24/04/2018)\u003c/strong\u003e: Finally, I did not get into GSoC this time too. No worries. I anticipated the results and prepared backup plans. Looking forward to a productive summer. :)\u003c/p\u003e\n","text":"                         I first heard about Google Summer of Code (GSoC) in my second year (2016). It was quite fascinating to know that such a program exists (possibly because of that super attractive amount of money, $5500 at that time). I researched about it and sent emails to some mentors. The replies were mostly encouraging, but I still could not gather the courage to apply as I used to doubt my capabilities. Then last year (2017) again, I decided that I should try for GSoC one more time. I looked for the projects, started reading codebase of one project, but due to my lack of determination, I again did not apply.\nIn the summers of 2017, I got some time to think about it. I decided that for the next year, I will try everything to make sure that I apply for GSoC 2018. I started coding as much as possible and pushing my code to GitHub to build an impressive profile.\nNow I can say that I am satisfied with my efforts to some extent. I did start some good open source projects. They are not very extraordinary, but something is better than nothing. I dived into Debian packaging also and volunteered for a FOSS event. Spreading awareness about FOSS is also contributing to FOSS. Isn\u0026rsquo;t it?\nComing back to GSoC, this year, I have successfully submitted a proposal to the Debian Project. It does not matter whether I get it or not. I overcame one of my biggest fears of doubting my capabilities. It is something that I was trying to do for the last two years. This moment is worth celebrating.\nRead about my GSoC project on Boot Many Machines via Bittorrent. It is related to something which I learned in SSL as SSL admin.\nRead my project proposal on Google Drive or Debian Wiki.\n    Eagerly waiting for the results. 😄\nUpdate(24/04/2018): Finally, I did not get into GSoC this time too. No worries. I anticipated the results and prepared backup plans. Looking forward to a productive summer. :)\n"},"name":"So I Applied for GSoC","published":"2018-03-28T20:58:26+05:30","summary":"I first heard about Google Summer of Code (GSoC) in my second year (2016). It was quite fascinating to know that such a program exists (possibly because of that super attractive amount of money, $5500 at that time). I researched about it and sent emails to some mentors.","type":"entry","url":"https://yashagarwal.in/posts/2018/03/so-i-applied-for-gsoc/"},{"content":{"html":"\u003cp\u003eA boy, probably of age 16, just cleared his 10th board exam. He saw people working on computers, and that fascinated him. So he had only one ambition. You got it, right? One fine day, suddenly his friend\u0026rsquo;s mother asked, \u0026ldquo;So what about the future? You are going to enter in class 11th. It is the right time to decide about your future. What do you want to become, a doctor or an engineer?\u0026rdquo; The boy had no clue how big that question was. What the cost would have been. He simply nodded and said, \u0026ldquo;I like computers very much so I would go for engineering.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThat\u0026rsquo;s it. He decided his fate.\u003c/p\u003e\n\u003cp\u003eSo here comes the day\u003c/p\u003e\n\u003ch2 id=\"an-accident\"\u003eAn accident\u003c/h2\u003e\n\u003cp\u003eAfter that day, he got into a coaching institute which promised a good rank in JEE. He was told that he would have to study consistently and regularly. The boy, being a determined one, started studying day and night.\u003c/p\u003e\n\u003cp\u003eThis continued for two years. Finally, after giving 12th board exams, he gave JEE. Unfortunately, he didn\u0026rsquo;t even get into extended merit list.\u003c/p\u003e\n\u003cp\u003eDevastated, he pledged not to give up. Oh, that stupid silly guy! He decided to try for one more year.\u003c/p\u003e\n\u003cp\u003eHe joined another institute in his city. Again the same routine, studying day and night to fulfill \u003cem\u003ehis\u003c/em\u003e dreams.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eResult\u003c/em\u003e: Same, Fail!\u003c/p\u003e\n\u003cp\u003eBut somehow he got a decent rank in JEE Mains thanks to his excellent performance in board exams.\u003c/p\u003e\n\u003ch2 id=\"a-disaster\"\u003eA disaster\u003c/h2\u003e\n\u003cp\u003eNow he had to face one more question. Which college and which branch? For him, the answer was simple. Go to any South Indian college thanks to the influence of his cousins on him (who were very successful in their lives, of course!). He chose Computer Science and Engineering because\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHe loved computers.\u003c/li\u003e\n\u003cli\u003eEverybody said, \u0026ldquo;Bahut scope hai is branch me.\u0026rdquo;\u003c/li\u003e\n\u003cli\u003eEvery top ranker of this country choose this branch.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSo the decision was clear. He packed his bag and left home for a NIT situated some 2200 kms far, the comp-sci branch.\u003c/p\u003e\n\u003ch2 id=\"the-coding-disaster\"\u003eThe coding disaster\u003c/h2\u003e\n\u003cp\u003eHe reached the college. He loved new people, new place, new environment, everything was new, right!. Studies started. He got good grades initially until the real coding and Computer Science related stuff started as courses. His grades fell drastically, his morale too. He got good marks enough to pass the courses. He tried giving his best, but all concepts seemed so alien to him as they wouldn\u0026rsquo;t stay inside his head.\u003c/p\u003e\n\u003cp\u003eThat guy is now about to complete his 2nd year and just thinking what went wrong with him. He is still trying to keep his journey on the right track. Whether he will be able to finish it successfully or not, only time will tell.\u003c/p\u003e\n\u003cp\u003eAt last one more year is coming, and it\u0026rsquo;s story will also come here next year.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.quora.com/What-were-you-once-that-youll-never-be-again/answer/Nishant-Kumar-187?srid=8MaF%EF%BF%BDshare=8df79cac\"\u003eInspired by this Quora Post\u003c/a\u003e\u003c/p\u003e\n","text":"A boy, probably of age 16, just cleared his 10th board exam. He saw people working on computers, and that fascinated him. So he had only one ambition. You got it, right? One fine day, suddenly his friend\u0026rsquo;s mother asked, \u0026ldquo;So what about the future? You are going to enter in class 11th. It is the right time to decide about your future. What do you want to become, a doctor or an engineer?\u0026rdquo; The boy had no clue how big that question was. What the cost would have been. He simply nodded and said, \u0026ldquo;I like computers very much so I would go for engineering.\u0026rdquo;\nThat\u0026rsquo;s it. He decided his fate.\nSo here comes the day\nAn accident After that day, he got into a coaching institute which promised a good rank in JEE. He was told that he would have to study consistently and regularly. The boy, being a determined one, started studying day and night.\nThis continued for two years. Finally, after giving 12th board exams, he gave JEE. Unfortunately, he didn\u0026rsquo;t even get into extended merit list.\nDevastated, he pledged not to give up. Oh, that stupid silly guy! He decided to try for one more year.\nHe joined another institute in his city. Again the same routine, studying day and night to fulfill his dreams.\nResult: Same, Fail!\nBut somehow he got a decent rank in JEE Mains thanks to his excellent performance in board exams.\nA disaster Now he had to face one more question. Which college and which branch? For him, the answer was simple. Go to any South Indian college thanks to the influence of his cousins on him (who were very successful in their lives, of course!). He chose Computer Science and Engineering because\n He loved computers. Everybody said, \u0026ldquo;Bahut scope hai is branch me.\u0026rdquo; Every top ranker of this country choose this branch.  So the decision was clear. He packed his bag and left home for a NIT situated some 2200 kms far, the comp-sci branch.\nThe coding disaster He reached the college. He loved new people, new place, new environment, everything was new, right!. Studies started. He got good grades initially until the real coding and Computer Science related stuff started as courses. His grades fell drastically, his morale too. He got good marks enough to pass the courses. He tried giving his best, but all concepts seemed so alien to him as they wouldn\u0026rsquo;t stay inside his head.\nThat guy is now about to complete his 2nd year and just thinking what went wrong with him. He is still trying to keep his journey on the right track. Whether he will be able to finish it successfully or not, only time will tell.\nAt last one more year is coming, and it\u0026rsquo;s story will also come here next year.\nInspired by this Quora Post\n"},"name":"Searching the goal","published":"2016-04-10T00:33:16Z","summary":"A boy, probably of age 16, just cleared his 10th board exam. He saw people working on computers, and that fascinated him. So he had only one ambition. You got it, right? One fine day, suddenly his friend\u0026rsquo;s mother asked, \u0026ldquo;So what about the future? You are going to enter in class 11th. It is the right time to decide about your future. What do you want to become, a doctor or an engineer?","type":"entry","url":"https://yashagarwal.in/posts/2016/04/searching-the-goal/"}],"name":"CSE","type":"feed","url":"https://yashagarwal.in/tags/cse/"}