{"author":{"name":"Yash Agarwal","type":"card","url":"https://yashagarwal.in/"},"content":{"html":"\u003cp\u003eFour years ago, in this very month of June, JEE Mains results were out. I had screwed up my JEE Advanced, so I had to settle for an NIT. My AIR was good enough to get me a seat of Computer Science and Engineering in any of the NITs except the first three (at that time Trichy, Warangal, and Surathkal). I was skeptical about going to \u003ca href=\"http://nitc.ac.in/\"\u003eNIT Calicut\u003c/a\u003e because of its distance from my native place, so NIT Allahabad was the most suitable choice. However, in the end, I decided to give preference to NIT Calicut over NIT Allahabad. One of the many reasons for this decision was an excellent \u003ca href=\"http://dsanghi.blogspot.com/2011/05/my-2011-list-of-recommended-csit.html\"\u003earticle\u003c/a\u003e by Dr. Dheeraj Sanghi, a retired professor from IIT Kanpur. His blog post was the primary reason; I decided to go with NIT Calicut. Now that I have graduated from NIT Calicut, I think it is the right time to document my observations about the CSE department of NIT Calicut from the perspective of a student.\u003c/p\u003e\n\u003cp\u003eMy exposure to the CSE department was limited to the facilities provided to undergraduate students only (almost everything except some academic facilities), so I am not entirely sure if this article will help any of the postgraduate students out there. However, some points below might help you decide about the non-academic activities of the department.\u003c/p\u003e\n\u003ch2 id=\"faculties\"\u003eFaculties\u003c/h2\u003e\n\u003cp\u003eLike every other NIT, NIT Calicut also suffers from the lack of permanent faculties. Most of the faculties in the department are recruited on a contract basis (ad-hoc). It is \u003cstrong\u003enot\u003c/strong\u003e necessarily a \u003ca href=\"http://dsanghi.blogspot.com/2018/05/teaching-by-temps-it-is-budget-issue-too.html\"\u003ebad\u003c/a\u003e thing, but many a time, an ad-hoc faculty gets to teach a subject where one does not hold strong command. In that case, the subject becomes a burden for both student and teacher. It happened to me many times when I was stuck in a situation that I ended up losing my interest in the subject as well as grades.\u003c/p\u003e\n\u003cp\u003eMost of the core subjects are taught by permanent faculties who are very good at their subjects. These faculties are very experienced and are alumni of some of India\u0026rsquo;s top IITs and IISc. The department used to \u003ca href=\"http://dsanghi.blogspot.com/2011/05/my-2011-list-of-recommended-csit.html\"\u003eask\u003c/a\u003e new hires to get a postgraduate degree from some IIT or IISc, but this does not seem to be the case anymore.\u003c/p\u003e\n\u003cp\u003eMost of the professors prefer to teach traditional computer science subjects, so if you are interested in AI, Data Science, or any other such areas of computer science, then you might have to depend on self-study.\u003c/p\u003e\n\u003ch2 id=\"club-activities\"\u003eClub Activities\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"http://assoc.cse.nitc.ac.in\"\u003eCSEA\u003c/a\u003e is the main departmental club that organizes almost every co-curricular activity in the department. In my opinion, CSEA is the best department association in NIT Calicut. I was not a member of CSEA, so all of my views are from the perspective of an outsider. CSEA organizes talks and workshops for the freshers from time to time. I attended all the lectures and seminars arranged by CSEA in my initial years, and I feel that those workshops were quite beneficial for me as a student.\u003c/p\u003e\n\u003cp\u003eFOSSCell is a group of students who contribute to open-source software. FOSSCell organizes workshops related to Linux and open source contributions. It also organizes \u003ca href=\"http://fossmeet.in/\"\u003eFOSSMeet\u003c/a\u003e, the yearly free and open-source software conference organized in NIT-C. It is one of the largest gatherings of open source enthusiasts in South India. I have written two posts about my experience as a part of the organizing team of FOSSMeet. You can read them \u003ca href=\"/posts/2017/03/fossmeet17/\"\u003ehere\u003c/a\u003e and \u003ca href=\"/posts/2018/03/fossmeet18/\"\u003ehere\u003c/a\u003e. Attending and organizing FOSSMeet is one of the best experiences of my college life. The current executives of FOSSCell are actively working on improving the state of open source contributions in NIT-C. I hope the situation will change in the coming years.\u003c/p\u003e\n\u003cp\u003eThe students manage all the labs in the department. The \u003ca href=\"http://athena.nitc.ac.in\"\u003eSoftware Systems Lab\u003c/a\u003e is assigned to undergraduate students. This lab is probably the crown jewel and pride of every CS student of NIT Calicut. It remains open most of the time. All the department servers are kept in this lab and are managed independently by the student administrators chosen by the student administrators. The student administrators are given the responsibility to maintain all the department websites. I do not know if any other university or college in India provides such independence to its students. I was one of the student administrators in this lab, and I consider that this was the best thing that happened to me during my graduation.\u003c/p\u003e\n\u003ch2 id=\"the-infrastructure\"\u003eThe Infrastructure\u003c/h2\u003e\n\u003cp\u003eA traditional computer science course does not require many types of equipment except a laptop and a fast enough internet connection. Internet speed is not extraordinary in NIT-C, but it was sufficient for me. The network administrators blocked many websites, but if the site is related to coursework, sending a short mail was enough in most cases to get it unblocked.\u003c/p\u003e\n\u003cp\u003eThe labs are equipped with modern computer systems, and Ubuntu is installed on almost every department system. The particular emphasis on the use of open-source software is a big plus point for the department.\u003c/p\u003e\n\u003ch2 id=\"courses\"\u003eCourses\u003c/h2\u003e\n\u003cp\u003eThe curriculum was last updated in 2010. Since then, six batches have graduated. I think it is an excellent time to consider revising it. The current curriculum is good enough for most traditional CS subjects, but its focus on the present buzzwords of the CS world is very less. I heard that the department changed the curriculum for the batches joining 2017 onwards, but I doubt that there are any significant changes.\u003c/p\u003e\n\u003c!-- raw HTML omitted --\u003e\n\u003cp\u003eThe academics are taken quite seriously in the department (apparently). The level of question papers in examinations is generally very tough. I always felt the heat, at least. However, teachers are quite friendly and will help you with any of your queries.\u003c/p\u003e\n\u003cp\u003eThe situation of lab courses (except OS, Compilers, and DSA lab) in the department is very pathetic. Operating Systems lab and Compiler lab have a well-defined structure, and the feeling of developing your tiny OS or compiler is one of the best feelings ever. Data Structure and Algorithms lab runs in parallel to the corresponding theory course, and that helps students in understanding theory by practice.\u003c/p\u003e\n\u003cp\u003eI cannot say the same about any other lab in the department; most of the students end up learning nothing new from these lab courses. The problem is in the way these courses are handled. There does not seem to be a proper structure of teaching in these courses. Students are expected to learn on their own and come to the lab and give exams. Although most of the time, the corresponding theory course carries marks for a mini project which compensates for the lab course, these lab courses do have some scope for improvements.\u003c/p\u003e\n\u003ch2 id=\"placements--higher-studies\"\u003ePlacements \u0026amp; Higher Studies\u003c/h2\u003e\n\u003cp\u003eThe department does not handle placements, but the quality of education and the focus on industry-oriented courses do affect the placements. The placement department of NIT-C has been doing an excellent job of maintaining a track record of over 90% placements from computer science every year.\u003c/p\u003e\n\u003cp\u003eDepartment, as such, does not focus on placements much. I feel that the department is more interested in making researchers than software engineers. Most of the courses are very heavily inclined towards theory. From my batch, I know at least ten people who are planning to go to the USA for higher studies in the next two years. The faculties also encourage students to pursue higher education (and subsequently research). Perhaps, it is one of the reasons that the state of competitive coding is not very good in the department.\u003c/p\u003e\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\u003cp\u003eDespite continuous lack of good permanent faculties and its location disadvantages, CSED of NIT-C has managed to produce competent engineers year by year. Spending four years in Kerala can be a different experience for outsiders, especially North Indians, but it is an experience worth gaining. If you have a good rank in JEE Mains and do not mind going too far from home, CSED of NIT Calicut is an excellent choice. I hope you will not regret the decision, though I will not say the same about other departments of NIT-C.\u003c/p\u003e\n\u003cp\u003eIf you decide to join NIT-C, do read my article about my \u003ca href=\"/posts/2018/06/mistakes-that-i-made-in-nitc/\"\u003eexperience\u003c/a\u003e at NIT Calicut.\u003c/p\u003e\n\u003cp\u003eThanks to my friends \u003ca href=\"https://www.linkedin.com/in/aashishsatya\"\u003eAashish\u003c/a\u003e, \u003ca href=\"https://www.linkedin.com/in/mahaveer-chouhan-575abba7/\"\u003eMahaveer\u003c/a\u003e and \u003ca href=\"https://www.facebook.com/faris.shajahan.1\"\u003eFaris\u003c/a\u003e for reading the drafts of this article and providing their suggestions.\u003c/p\u003e\n\u003cp\u003eBest wishes. Cheers 😄\u003c/p\u003e\n","text":"Four years ago, in this very month of June, JEE Mains results were out. I had screwed up my JEE Advanced, so I had to settle for an NIT. My AIR was good enough to get me a seat of Computer Science and Engineering in any of the NITs except the first three (at that time Trichy, Warangal, and Surathkal). I was skeptical about going to NIT Calicut because of its distance from my native place, so NIT Allahabad was the most suitable choice. However, in the end, I decided to give preference to NIT Calicut over NIT Allahabad. One of the many reasons for this decision was an excellent article by Dr. Dheeraj Sanghi, a retired professor from IIT Kanpur. His blog post was the primary reason; I decided to go with NIT Calicut. Now that I have graduated from NIT Calicut, I think it is the right time to document my observations about the CSE department of NIT Calicut from the perspective of a student.\nMy exposure to the CSE department was limited to the facilities provided to undergraduate students only (almost everything except some academic facilities), so I am not entirely sure if this article will help any of the postgraduate students out there. However, some points below might help you decide about the non-academic activities of the department.\nFaculties Like every other NIT, NIT Calicut also suffers from the lack of permanent faculties. Most of the faculties in the department are recruited on a contract basis (ad-hoc). It is not necessarily a bad thing, but many a time, an ad-hoc faculty gets to teach a subject where one does not hold strong command. In that case, the subject becomes a burden for both student and teacher. It happened to me many times when I was stuck in a situation that I ended up losing my interest in the subject as well as grades.\nMost of the core subjects are taught by permanent faculties who are very good at their subjects. These faculties are very experienced and are alumni of some of India\u0026rsquo;s top IITs and IISc. The department used to ask new hires to get a postgraduate degree from some IIT or IISc, but this does not seem to be the case anymore.\nMost of the professors prefer to teach traditional computer science subjects, so if you are interested in AI, Data Science, or any other such areas of computer science, then you might have to depend on self-study.\nClub Activities CSEA is the main departmental club that organizes almost every co-curricular activity in the department. In my opinion, CSEA is the best department association in NIT Calicut. I was not a member of CSEA, so all of my views are from the perspective of an outsider. CSEA organizes talks and workshops for the freshers from time to time. I attended all the lectures and seminars arranged by CSEA in my initial years, and I feel that those workshops were quite beneficial for me as a student.\nFOSSCell is a group of students who contribute to open-source software. FOSSCell organizes workshops related to Linux and open source contributions. It also organizes FOSSMeet, the yearly free and open-source software conference organized in NIT-C. It is one of the largest gatherings of open source enthusiasts in South India. I have written two posts about my experience as a part of the organizing team of FOSSMeet. You can read them here and here. Attending and organizing FOSSMeet is one of the best experiences of my college life. The current executives of FOSSCell are actively working on improving the state of open source contributions in NIT-C. I hope the situation will change in the coming years.\nThe students manage all the labs in the department. The Software Systems Lab is assigned to undergraduate students. This lab is probably the crown jewel and pride of every CS student of NIT Calicut. It remains open most of the time. All the department servers are kept in this lab and are managed independently by the student administrators chosen by the student administrators. The student administrators are given the responsibility to maintain all the department websites. I do not know if any other university or college in India provides such independence to its students. I was one of the student administrators in this lab, and I consider that this was the best thing that happened to me during my graduation.\nThe Infrastructure A traditional computer science course does not require many types of equipment except a laptop and a fast enough internet connection. Internet speed is not extraordinary in NIT-C, but it was sufficient for me. The network administrators blocked many websites, but if the site is related to coursework, sending a short mail was enough in most cases to get it unblocked.\nThe labs are equipped with modern computer systems, and Ubuntu is installed on almost every department system. The particular emphasis on the use of open-source software is a big plus point for the department.\nCourses The curriculum was last updated in 2010. Since then, six batches have graduated. I think it is an excellent time to consider revising it. The current curriculum is good enough for most traditional CS subjects, but its focus on the present buzzwords of the CS world is very less. I heard that the department changed the curriculum for the batches joining 2017 onwards, but I doubt that there are any significant changes.\nThe academics are taken quite seriously in the department (apparently). The level of question papers in examinations is generally very tough. I always felt the heat, at least. However, teachers are quite friendly and will help you with any of your queries.\nThe situation of lab courses (except OS, Compilers, and DSA lab) in the department is very pathetic. Operating Systems lab and Compiler lab have a well-defined structure, and the feeling of developing your tiny OS or compiler is one of the best feelings ever. Data Structure and Algorithms lab runs in parallel to the corresponding theory course, and that helps students in understanding theory by practice.\nI cannot say the same about any other lab in the department; most of the students end up learning nothing new from these lab courses. The problem is in the way these courses are handled. There does not seem to be a proper structure of teaching in these courses. Students are expected to learn on their own and come to the lab and give exams. Although most of the time, the corresponding theory course carries marks for a mini project which compensates for the lab course, these lab courses do have some scope for improvements.\nPlacements \u0026amp; Higher Studies The department does not handle placements, but the quality of education and the focus on industry-oriented courses do affect the placements. The placement department of NIT-C has been doing an excellent job of maintaining a track record of over 90% placements from computer science every year.\nDepartment, as such, does not focus on placements much. I feel that the department is more interested in making researchers than software engineers. Most of the courses are very heavily inclined towards theory. From my batch, I know at least ten people who are planning to go to the USA for higher studies in the next two years. The faculties also encourage students to pursue higher education (and subsequently research). Perhaps, it is one of the reasons that the state of competitive coding is not very good in the department.\nConclusion Despite continuous lack of good permanent faculties and its location disadvantages, CSED of NIT-C has managed to produce competent engineers year by year. Spending four years in Kerala can be a different experience for outsiders, especially North Indians, but it is an experience worth gaining. If you have a good rank in JEE Mains and do not mind going too far from home, CSED of NIT Calicut is an excellent choice. I hope you will not regret the decision, though I will not say the same about other departments of NIT-C.\nIf you decide to join NIT-C, do read my article about my experience at NIT Calicut.\nThanks to my friends Aashish, Mahaveer and Faris for reading the drafts of this article and providing their suggestions.\nBest wishes. Cheers 😄\n"},"name":"The Good and Bad about CSED of NIT-C","published":"2018-06-14T17:59:28+05:30","summary":"Four years ago, in this very month of June, JEE Mains results were out. I had screwed up my JEE Advanced, so I had to settle for an NIT. My AIR was good enough to get me a seat of Computer Science and Engineering in any of the NITs except the first three (at that time Trichy, Warangal, and Surathkal). I was skeptical about going to NIT Calicut because of its distance from my native place, so NIT Allahabad was the most suitable choice.","type":"entry","url":"https://yashagarwal.in/posts/2018/06/the-good-and-bad-about-csed-of-nit-c/"}