{"author":{"name":"Yash Agarwal","type":"card","url":"https://yashagarwal.in/"},"content":{"html":"\u003cp\u003eA boy, probably of age 16, just cleared his 10th board exam. He saw people working on computers, and that fascinated him. So he had only one ambition. You got it, right? One fine day, suddenly his friend\u0026rsquo;s mother asked, \u0026ldquo;So what about the future? You are going to enter in class 11th. It is the right time to decide about your future. What do you want to become, a doctor or an engineer?\u0026rdquo; The boy had no clue how big that question was. What the cost would have been. He simply nodded and said, \u0026ldquo;I like computers very much so I would go for engineering.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThat\u0026rsquo;s it. He decided his fate.\u003c/p\u003e\n\u003cp\u003eSo here comes the day\u003c/p\u003e\n\u003ch2 id=\"an-accident\"\u003eAn accident\u003c/h2\u003e\n\u003cp\u003eAfter that day, he got into a coaching institute which promised a good rank in JEE. He was told that he would have to study consistently and regularly. The boy, being a determined one, started studying day and night.\u003c/p\u003e\n\u003cp\u003eThis continued for two years. Finally, after giving 12th board exams, he gave JEE. Unfortunately, he didn\u0026rsquo;t even get into extended merit list.\u003c/p\u003e\n\u003cp\u003eDevastated, he pledged not to give up. Oh, that stupid silly guy! He decided to try for one more year.\u003c/p\u003e\n\u003cp\u003eHe joined another institute in his city. Again the same routine, studying day and night to fulfill \u003cem\u003ehis\u003c/em\u003e dreams.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eResult\u003c/em\u003e: Same, Fail!\u003c/p\u003e\n\u003cp\u003eBut somehow he got a decent rank in JEE Mains thanks to his excellent performance in board exams.\u003c/p\u003e\n\u003ch2 id=\"a-disaster\"\u003eA disaster\u003c/h2\u003e\n\u003cp\u003eNow he had to face one more question. Which college and which branch? For him, the answer was simple. Go to any South Indian college thanks to the influence of his cousins on him (who were very successful in their lives, of course!). He chose Computer Science and Engineering because\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHe loved computers.\u003c/li\u003e\n\u003cli\u003eEverybody said, \u0026ldquo;Bahut scope hai is branch me.\u0026rdquo;\u003c/li\u003e\n\u003cli\u003eEvery top ranker of this country choose this branch.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSo the decision was clear. He packed his bag and left home for a NIT situated some 2200 kms far, the comp-sci branch.\u003c/p\u003e\n\u003ch2 id=\"the-coding-disaster\"\u003eThe coding disaster\u003c/h2\u003e\n\u003cp\u003eHe reached the college. He loved new people, new place, new environment, everything was new, right!. Studies started. He got good grades initially until the real coding and Computer Science related stuff started as courses. His grades fell drastically, his morale too. He got good marks enough to pass the courses. He tried giving his best, but all concepts seemed so alien to him as they wouldn\u0026rsquo;t stay inside his head.\u003c/p\u003e\n\u003cp\u003eThat guy is now about to complete his 2nd year and just thinking what went wrong with him. He is still trying to keep his journey on the right track. Whether he will be able to finish it successfully or not, only time will tell.\u003c/p\u003e\n\u003cp\u003eAt last one more year is coming, and it\u0026rsquo;s story will also come here next year.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.quora.com/What-were-you-once-that-youll-never-be-again/answer/Nishant-Kumar-187?srid=8MaF%EF%BF%BDshare=8df79cac\"\u003eInspired by this Quora Post\u003c/a\u003e\u003c/p\u003e\n","text":"A boy, probably of age 16, just cleared his 10th board exam. He saw people working on computers, and that fascinated him. So he had only one ambition. You got it, right? One fine day, suddenly his friend\u0026rsquo;s mother asked, \u0026ldquo;So what about the future? You are going to enter in class 11th. It is the right time to decide about your future. What do you want to become, a doctor or an engineer?\u0026rdquo; The boy had no clue how big that question was. What the cost would have been. He simply nodded and said, \u0026ldquo;I like computers very much so I would go for engineering.\u0026rdquo;\nThat\u0026rsquo;s it. He decided his fate.\nSo here comes the day\nAn accident After that day, he got into a coaching institute which promised a good rank in JEE. He was told that he would have to study consistently and regularly. The boy, being a determined one, started studying day and night.\nThis continued for two years. Finally, after giving 12th board exams, he gave JEE. Unfortunately, he didn\u0026rsquo;t even get into extended merit list.\nDevastated, he pledged not to give up. Oh, that stupid silly guy! He decided to try for one more year.\nHe joined another institute in his city. Again the same routine, studying day and night to fulfill his dreams.\nResult: Same, Fail!\nBut somehow he got a decent rank in JEE Mains thanks to his excellent performance in board exams.\nA disaster Now he had to face one more question. Which college and which branch? For him, the answer was simple. Go to any South Indian college thanks to the influence of his cousins on him (who were very successful in their lives, of course!). He chose Computer Science and Engineering because\n He loved computers. Everybody said, \u0026ldquo;Bahut scope hai is branch me.\u0026rdquo; Every top ranker of this country choose this branch.  So the decision was clear. He packed his bag and left home for a NIT situated some 2200 kms far, the comp-sci branch.\nThe coding disaster He reached the college. He loved new people, new place, new environment, everything was new, right!. Studies started. He got good grades initially until the real coding and Computer Science related stuff started as courses. His grades fell drastically, his morale too. He got good marks enough to pass the courses. He tried giving his best, but all concepts seemed so alien to him as they wouldn\u0026rsquo;t stay inside his head.\nThat guy is now about to complete his 2nd year and just thinking what went wrong with him. He is still trying to keep his journey on the right track. Whether he will be able to finish it successfully or not, only time will tell.\nAt last one more year is coming, and it\u0026rsquo;s story will also come here next year.\nInspired by this Quora Post\n"},"name":"Searching the goal","published":"2016-04-10T00:33:16Z","summary":"A boy, probably of age 16, just cleared his 10th board exam. He saw people working on computers, and that fascinated him. So he had only one ambition. You got it, right? One fine day, suddenly his friend\u0026rsquo;s mother asked, \u0026ldquo;So what about the future? You are going to enter in class 11th. It is the right time to decide about your future. What do you want to become, a doctor or an engineer?","type":"entry","url":"https://yashagarwal.in/posts/2016/04/searching-the-goal/"}