{"author":{"name":"Yash Agarwal","type":"card","url":"https://yashagarwal.in/"},"children":[{"content":{"html":"\n\n\n\n    \n\n    \n    \n\n    \n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/photoswipe.min.css\" integrity=\"sha256-sCl5PUOGMLfFYctzDW3MtRib0ctyUvI9Qsmq2wXOeBY=\" crossorigin=\"anonymous\" /\u003e\n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/default-skin/default-skin.min.css\" integrity=\"sha256-BFeI1V+Vh1Rk37wswuOYn5lsTcaU96hGaI7OUVCLjPc=\" crossorigin=\"anonymous\" /\u003e\n\n    \n    \u003clink rel=\"stylesheet\" href=\"/css/photoswipe.min.d780348a887d97b4d6cc664301a2941706e4a02aeb1533524fcce3b7b9b64b4f.css\"\u003e\n\n    \n\n    \n    \u003cdiv class=\"pswp\" tabindex=\"-1\" role=\"dialog\" aria-hidden=\"true\"\u003e\n        \n        \u003cdiv class=\"pswp__bg\"\u003e\u003c/div\u003e\n        \n        \u003cdiv class=\"pswp__scroll-wrap\"\u003e\n            \n            \u003cdiv class=\"pswp__container\"\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n            \u003c/div\u003e\n            \n            \u003cdiv class=\"pswp__ui pswp__ui--hidden\"\u003e\n                \u003cdiv class=\"pswp__top-bar\"\u003e\n                    \n                    \u003cdiv class=\"pswp__counter\"\u003e\u003c/div\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--close\" title=\"Close (Esc)\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--share\" title=\"Share\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--fs\" title=\"Toggle fullscreen\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--zoom\" title=\"Zoom in/out\"\u003e\u003c/button\u003e\n                    \n                    \n                    \u003cdiv class=\"pswp__preloader\"\u003e\n                        \u003cdiv class=\"pswp__preloader__icn\"\u003e\n                            \u003cdiv class=\"pswp__preloader__cut\"\u003e\n                                \u003cdiv class=\"pswp__preloader__donut\"\u003e\u003c/div\u003e\n                            \u003c/div\u003e\n                        \u003c/div\u003e\n                    \u003c/div\u003e\n                \u003c/div\u003e\n                \u003cdiv class=\"pswp__share-modal pswp__share-modal--hidden pswp__single-tap\"\u003e\n                    \u003cdiv class=\"pswp__share-tooltip\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--left\" title=\"Previous (arrow left)\"\u003e\n                \u003c/button\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--right\" title=\"Next (arrow right)\"\u003e\n                \u003c/button\u003e\n                \u003cdiv class=\"pswp__caption\"\u003e\n                    \u003cdiv class=\"pswp__caption__center\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\n    \u003c/div\u003e\n\n\n\n\n    \u003clink rel=\"stylesheet\" href=\"/css/hugo-easy-gallery.css\"\u003e\n    \n\n\n\u003cdiv class=\"box fancy-figure caption-position-none\"  itemscope itemtype=\"http://schema.org/ImageGallery\"\u003e\n    \u003cfigure  itemprop=\"associatedMedia\" itemscope itemtype=\"http://schema.org/ImageObject\"\u003e\n        \u003cdiv class=\"img\"\u003e\n            \u003cimg itemprop=\"thumbnail\" src=\"https://images.gr-assets.com/books/1403181687l/17994.jpg\" /\u003e\n        \u003c/div\u003e\n        \u003ca href=\"https://images.gr-assets.com/books/1403181687l/17994.jpg\" itemprop=\"contentUrl\"\u003e\u003c/a\u003e\n    \u003c/figure\u003e\n\u003c/div\u003e\n\n\u003cdiv class=\"rating-center\"\u003e\n    \u003cdiv class=\"Stars\" style=\"--rating: 5;\" aria-label=\"Rating of this book is 5 out of 5.\"\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cp\u003eI was interested in Cryptography and Number Theory during my undergraduate studies so reading the\nhistory of Cryptography in this book was intriguing for me. The author has done excellent work in making sure that even\nan uninitiated person in Cryptography can understand and appreciate the importance of work done in this field. The people\nunequipped with the necessary background knowledge will enjoy this book as much as the math nerds. The book\ncontains very little mathematical stuff, but the author tries to explain the ciphers by taking appropriate examples.\u003c/p\u003e\n\u003cp\u003eI enjoyed the story of the breaking of the Enigma Machine. It seems to be a perfect time to watch \u003cem\u003eThe\nImitation Game\u003c/em\u003e. 😄 The book gets boring in the post RSA part. Probably one reason behind this was my lack of\nknowledge about Quantum Computing. Although a few days back, two of my colleagues were discussing an idea about Quantum\nComputing. I overheard their discussion, and surprisingly, I was able to understand everything they were talking, to\nsome extent. So I\nguess that this book has at least initiated me to the field of Quantum Computing.\u003c/p\u003e\n\u003cp\u003eIt was a 5-star book for me, and it has reserved its place in my favorite books shelf. I will revisit this\nbook in future when I get a chance to teach Cryptography to someone. Before that, I need to learn Cryptography,\nright! Anyone reading this review, if you have any recommendations for books on Cryptography and Number Theory, please do\ncomment.\u003c/p\u003e\n\u003cp\u003eHere are some of my favorite quotes from the book (not in any particular order):\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eIt has been said that the First World War was the chemists’ war, because mustard gas and   chlorine were employed for\nthe first time, and that the Second World War was the physicists’ war, because the atom bomb was detonated.\nSimilarly, it has been argued that the Third World War would be the mathematicians’ war, because mathematicians will\nhave control over the next great weapon of war — information.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe only people who are in a position to point out my errors are also those who are not at liberty to reveal them.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHow to conceal a message within a hard-boiled egg by making an ink from a mixture of one ounce of alum and a pint of vinegar, and then using it to write on the shell. The solution penetrates the porous shell, and leaves a message on the surface of the hardened egg albumen, which can be read only when the shell is removed.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe security of a cryptosystem must not depend on keeping secret the crypto-algorithm. The security depends only on\nkeeping secret the key.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA man is crazy who writes a secret in any other way than one which will conceal it from the vulgar.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA code is defined as substitution at the level of words or phrases, whereas a cipher is defined as substitution at\nthe level of letters. Hence the term encipher means to scramble a message using a cipher, while encode means to\nscramble a message using a code. Similarly, the term decipher applies to unscrambling an enciphered message, and\ndecode to unscrambling an encoded message. The terms encrypt and decrypt are more general, and cover scrambling and\nunscrambling with respect to both codes and ciphers.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eI wish to God these calculations had been executed by steam! - Charles Babbage\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNothing should be as favorably regarded as intelligence; nothing should be as generously rewarded as intelligence;\nnothing should be as confidential as the work of intelligence. - Sun Tzu\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAdversity is one of the foundations of successful codebreaking.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Polish success in breaking the Enigma cipher can be attributed to three factors: fear, mathematics and\nespionage.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIt’s about right and wrong. In general terms. It’s a technical paper in mathematical logic, but it’s also about the\ndifficulty of telling right from wrong. People think—most people think—that in mathematics we always know what is\nright and what is wrong. Not so. Not any more.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eThe way to get to the top of the heap in terms of developing original research is to be a fool, because only fools\nkeep trying. You have idea number 1, you get excited, and it flops. Then you have idea number 2, you get excited,\nand it flops. Then you have idea number 99, you get excited, and it flops. Only a fool would be excited by the 100th\nidea, but it might take 100 ideas before one really pays off. Unless you’re foolish enough to be continually\nexcited, you won’t have the motivation, you won’t have the energy to carry it through. God rewards fools.\u003c/strong\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMixing yellow and blue paint to make green paint is a one-way function because it is easy to mix the paint, but\nimpossible to unmix it. Another one-way function is the cracking of an egg, because it is easy to crack an egg but\nimpossible then to return the egg to its original condition. For this reason, one-way functions are sometimes called\nHumpty Dumpty functions.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe easiest way to understand the concept of a two-way function is in terms of an everyday activity. The act of\nturning on a light switch is a function, because it turns an ordinary lightbulb into an illuminated lightbulb. This\nfunction is two-way because if a switch is turned on, it is easy enough to turn it off and return the light-bulb to\nits original state.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAn existence theorem shows that a particular concept is possible, but is not concerned with the details of the\nconcept.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe cannot know, as a matter of principle, the present in all its details.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePropose to an Englishman any principle, or any instrument, however admirable, and you will observe that the whole\neffort of the English mind is directed to find a difficulty, a defect, or an impossibility in it. If you speak to\nhim of a machine for peeling a potato, he will pronounce it impossible: if you peel a potato with it before his\neyes, he will declare it useless, because it will not slice a pineapple. - Charles Babbage\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCryptanalysis could not be invented until a civilization had reached a sufficiently sophisticated level of scholarship in several disciplines, including mathematics, statistics, and linguistics. The Muslim civilization provided an ideal cradle for cryptanalysis, because Islam demands justice in all spheres of human activity, and achieving this requires knowledge, or ilm. Every Muslim is obliged to pursue knowledge in all its forms, and the economic success of the Abbasid caliphate meant that scholars had the time, money, and materials required to fulfil their duty. They endeavoured to acquire knowledge of previous civilizations by obtaining Egyptian, Babylonian, Indian, Chinese, Farsi, Syriac, Armenian, Hebrew and Roman texts and translating them into Arabic. In 815, the Caliph of Ma\u0026rsquo;mun established in Baghdad the Bait al-Hikmah (\u0026lsquo;House of Wisdom\u0026rsquo;), a library and centre for translation.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eCheers 😄\u003c/p\u003e\n","text":"                               I was interested in Cryptography and Number Theory during my undergraduate studies so reading the history of Cryptography in this book was intriguing for me. The author has done excellent work in making sure that even an uninitiated person in Cryptography can understand and appreciate the importance of work done in this field. The people unequipped with the necessary background knowledge will enjoy this book as much as the math nerds. The book contains very little mathematical stuff, but the author tries to explain the ciphers by taking appropriate examples.\nI enjoyed the story of the breaking of the Enigma Machine. It seems to be a perfect time to watch The Imitation Game. 😄 The book gets boring in the post RSA part. Probably one reason behind this was my lack of knowledge about Quantum Computing. Although a few days back, two of my colleagues were discussing an idea about Quantum Computing. I overheard their discussion, and surprisingly, I was able to understand everything they were talking, to some extent. So I guess that this book has at least initiated me to the field of Quantum Computing.\nIt was a 5-star book for me, and it has reserved its place in my favorite books shelf. I will revisit this book in future when I get a chance to teach Cryptography to someone. Before that, I need to learn Cryptography, right! Anyone reading this review, if you have any recommendations for books on Cryptography and Number Theory, please do comment.\nHere are some of my favorite quotes from the book (not in any particular order):\n  It has been said that the First World War was the chemists’ war, because mustard gas and chlorine were employed for the first time, and that the Second World War was the physicists’ war, because the atom bomb was detonated. Similarly, it has been argued that the Third World War would be the mathematicians’ war, because mathematicians will have control over the next great weapon of war — information.\n  The only people who are in a position to point out my errors are also those who are not at liberty to reveal them.\n  How to conceal a message within a hard-boiled egg by making an ink from a mixture of one ounce of alum and a pint of vinegar, and then using it to write on the shell. The solution penetrates the porous shell, and leaves a message on the surface of the hardened egg albumen, which can be read only when the shell is removed.\n  The security of a cryptosystem must not depend on keeping secret the crypto-algorithm. The security depends only on keeping secret the key.\n  A man is crazy who writes a secret in any other way than one which will conceal it from the vulgar.\n  A code is defined as substitution at the level of words or phrases, whereas a cipher is defined as substitution at the level of letters. Hence the term encipher means to scramble a message using a cipher, while encode means to scramble a message using a code. Similarly, the term decipher applies to unscrambling an enciphered message, and decode to unscrambling an encoded message. The terms encrypt and decrypt are more general, and cover scrambling and unscrambling with respect to both codes and ciphers.\n  I wish to God these calculations had been executed by steam! - Charles Babbage\n  Nothing should be as favorably regarded as intelligence; nothing should be as generously rewarded as intelligence; nothing should be as confidential as the work of intelligence. - Sun Tzu\n  Adversity is one of the foundations of successful codebreaking.\n  The Polish success in breaking the Enigma cipher can be attributed to three factors: fear, mathematics and espionage.\n  It’s about right and wrong. In general terms. It’s a technical paper in mathematical logic, but it’s also about the difficulty of telling right from wrong. People think—most people think—that in mathematics we always know what is right and what is wrong. Not so. Not any more.\n  The way to get to the top of the heap in terms of developing original research is to be a fool, because only fools keep trying. You have idea number 1, you get excited, and it flops. Then you have idea number 2, you get excited, and it flops. Then you have idea number 99, you get excited, and it flops. Only a fool would be excited by the 100th idea, but it might take 100 ideas before one really pays off. Unless you’re foolish enough to be continually excited, you won’t have the motivation, you won’t have the energy to carry it through. God rewards fools.\n  Mixing yellow and blue paint to make green paint is a one-way function because it is easy to mix the paint, but impossible to unmix it. Another one-way function is the cracking of an egg, because it is easy to crack an egg but impossible then to return the egg to its original condition. For this reason, one-way functions are sometimes called Humpty Dumpty functions.\n  The easiest way to understand the concept of a two-way function is in terms of an everyday activity. The act of turning on a light switch is a function, because it turns an ordinary lightbulb into an illuminated lightbulb. This function is two-way because if a switch is turned on, it is easy enough to turn it off and return the light-bulb to its original state.\n  An existence theorem shows that a particular concept is possible, but is not concerned with the details of the concept.\n  We cannot know, as a matter of principle, the present in all its details.\n  Propose to an Englishman any principle, or any instrument, however admirable, and you will observe that the whole effort of the English mind is directed to find a difficulty, a defect, or an impossibility in it. If you speak to him of a machine for peeling a potato, he will pronounce it impossible: if you peel a potato with it before his eyes, he will declare it useless, because it will not slice a pineapple. - Charles Babbage\n  Cryptanalysis could not be invented until a civilization had reached a sufficiently sophisticated level of scholarship in several disciplines, including mathematics, statistics, and linguistics. The Muslim civilization provided an ideal cradle for cryptanalysis, because Islam demands justice in all spheres of human activity, and achieving this requires knowledge, or ilm. Every Muslim is obliged to pursue knowledge in all its forms, and the economic success of the Abbasid caliphate meant that scholars had the time, money, and materials required to fulfil their duty. They endeavoured to acquire knowledge of previous civilizations by obtaining Egyptian, Babylonian, Indian, Chinese, Farsi, Syriac, Armenian, Hebrew and Roman texts and translating them into Arabic. In 815, the Caliph of Ma\u0026rsquo;mun established in Baghdad the Bait al-Hikmah (\u0026lsquo;House of Wisdom\u0026rsquo;), a library and centre for translation.\n  Cheers 😄\n"},"name":"The Code Book - Review","published":"2018-12-15T19:04:38+05:30","summary":"I was interested in Cryptography and Number Theory during my undergraduate studies so reading the history of Cryptography in this book was intriguing for me. The author has done excellent work in making sure that even an uninitiated person in Cryptography can understand and appreciate the importance of work done in this field.","type":"entry","url":"https://yashagarwal.in/notes/2018-12-15-the-code-book-review/"},{"content":{"html":"\n\n\n\n    \n\n    \n    \n\n    \n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/photoswipe.min.css\" integrity=\"sha256-sCl5PUOGMLfFYctzDW3MtRib0ctyUvI9Qsmq2wXOeBY=\" crossorigin=\"anonymous\" /\u003e\n    \u003clink rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/photoswipe/4.1.1/default-skin/default-skin.min.css\" integrity=\"sha256-BFeI1V+Vh1Rk37wswuOYn5lsTcaU96hGaI7OUVCLjPc=\" crossorigin=\"anonymous\" /\u003e\n\n    \n    \u003clink rel=\"stylesheet\" href=\"/css/photoswipe.min.d780348a887d97b4d6cc664301a2941706e4a02aeb1533524fcce3b7b9b64b4f.css\"\u003e\n\n    \n\n    \n    \u003cdiv class=\"pswp\" tabindex=\"-1\" role=\"dialog\" aria-hidden=\"true\"\u003e\n        \n        \u003cdiv class=\"pswp__bg\"\u003e\u003c/div\u003e\n        \n        \u003cdiv class=\"pswp__scroll-wrap\"\u003e\n            \n            \u003cdiv class=\"pswp__container\"\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n                \u003cdiv class=\"pswp__item\"\u003e\u003c/div\u003e\n            \u003c/div\u003e\n            \n            \u003cdiv class=\"pswp__ui pswp__ui--hidden\"\u003e\n                \u003cdiv class=\"pswp__top-bar\"\u003e\n                    \n                    \u003cdiv class=\"pswp__counter\"\u003e\u003c/div\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--close\" title=\"Close (Esc)\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--share\" title=\"Share\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--fs\" title=\"Toggle fullscreen\"\u003e\u003c/button\u003e\n                    \u003cbutton class=\"pswp__button pswp__button--zoom\" title=\"Zoom in/out\"\u003e\u003c/button\u003e\n                    \n                    \n                    \u003cdiv class=\"pswp__preloader\"\u003e\n                        \u003cdiv class=\"pswp__preloader__icn\"\u003e\n                            \u003cdiv class=\"pswp__preloader__cut\"\u003e\n                                \u003cdiv class=\"pswp__preloader__donut\"\u003e\u003c/div\u003e\n                            \u003c/div\u003e\n                        \u003c/div\u003e\n                    \u003c/div\u003e\n                \u003c/div\u003e\n                \u003cdiv class=\"pswp__share-modal pswp__share-modal--hidden pswp__single-tap\"\u003e\n                    \u003cdiv class=\"pswp__share-tooltip\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--left\" title=\"Previous (arrow left)\"\u003e\n                \u003c/button\u003e\n                \u003cbutton class=\"pswp__button pswp__button--arrow--right\" title=\"Next (arrow right)\"\u003e\n                \u003c/button\u003e\n                \u003cdiv class=\"pswp__caption\"\u003e\n                    \u003cdiv class=\"pswp__caption__center\"\u003e\u003c/div\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\n    \u003c/div\u003e\n\n\n\n\n    \u003clink rel=\"stylesheet\" href=\"/css/hugo-easy-gallery.css\"\u003e\n    \n\n\n\u003cdiv class=\"box fancy-figure caption-position-none\"  itemscope itemtype=\"http://schema.org/ImageGallery\"\u003e\n    \u003cfigure  itemprop=\"associatedMedia\" itemscope itemtype=\"http://schema.org/ImageObject\"\u003e\n        \u003cdiv class=\"img\"\u003e\n            \u003cimg itemprop=\"thumbnail\" src=\"https://images.gr-assets.com/books/1483980422l/785820.jpg\" /\u003e\n        \u003c/div\u003e\n        \u003ca href=\"https://images.gr-assets.com/books/1483980422l/785820.jpg\" itemprop=\"contentUrl\"\u003e\u003c/a\u003e\n    \u003c/figure\u003e\n\u003c/div\u003e\n\n\u003cdiv class=\"rating-center\"\u003e\n    \u003cdiv class=\"Stars\" style=\"--rating: 4;\" aria-label=\"Rating of this book is 4 out of 5.\"\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cp\u003eThere was a time when I used to despise Physics. I still do not know the exact reason behind this feeling because I was much interest in Physics in general. Perhaps the mathematical questions of JEE put me off.\u003c/p\u003e\n\u003cp\u003eI picked this book thinking that it will have something related to Quantum Computing (I am pretty much new to this area of CS), but I was entirely wrong in my guess. This book is all about the greats of the Physics world in the first half of the 19th century and how quantum theory came into existence.\u003c/p\u003e\n\u003cp\u003eHowever, I must say, this book has not disappointed me. It was a fun refresher to the notions of Physics that I had last studied almost five years before. I had forgotten many of the theoretical concepts since my last class on the subject. However, as I started reading, my mind began unleashing the forgotten knowledge. I was pretty amused to see that I still remember many of the concepts, although not in great depth.\u003c/p\u003e\n\u003cp\u003eThis book assumes that the reader has sufficient knowledge of secondary school Physics concepts, which may not be the case always. Though there are diagrams and illustrations to supplement the text, the level of the book sometimes feels too high for its title. The authors have not shied away for using complex equations and the explanations to the equations is also very detailed.\u003c/p\u003e\n\u003cp\u003eIn my opinion, this book is an excellent introduction to Quantum Physics for people with a background in Computer Science, Physics and Mathematics. For others, it might be slightly heavy to digest.\u003c/p\u003e\n","text":"                               There was a time when I used to despise Physics. I still do not know the exact reason behind this feeling because I was much interest in Physics in general. Perhaps the mathematical questions of JEE put me off.\nI picked this book thinking that it will have something related to Quantum Computing (I am pretty much new to this area of CS), but I was entirely wrong in my guess. This book is all about the greats of the Physics world in the first half of the 19th century and how quantum theory came into existence.\nHowever, I must say, this book has not disappointed me. It was a fun refresher to the notions of Physics that I had last studied almost five years before. I had forgotten many of the theoretical concepts since my last class on the subject. However, as I started reading, my mind began unleashing the forgotten knowledge. I was pretty amused to see that I still remember many of the concepts, although not in great depth.\nThis book assumes that the reader has sufficient knowledge of secondary school Physics concepts, which may not be the case always. Though there are diagrams and illustrations to supplement the text, the level of the book sometimes feels too high for its title. The authors have not shied away for using complex equations and the explanations to the equations is also very detailed.\nIn my opinion, this book is an excellent introduction to Quantum Physics for people with a background in Computer Science, Physics and Mathematics. For others, it might be slightly heavy to digest.\n"},"name":"Introducing Quantum Theory - Review","published":"2018-11-18T20:31:06+05:30","summary":"There was a time when I used to despise Physics. I still do not know the exact reason behind this feeling because I was much interest in Physics in general. Perhaps the mathematical questions of JEE put me off.","type":"entry","url":"https://yashagarwal.in/notes/2018-11-18-introducing-quantum-theory-review/"}],"name":"Science","type":"feed","url":"https://yashagarwal.in/tags/science/"}